[
  {
    "title": "Jet Fuel Gelato",
    "images": [
      "/images/strains/jet-fuel-gelato-from-compound-genetics/jet-fuel-gelato-from-compound-genetics-1.jpg"
    ],
    "description": [
      "Jet Fuel Gelato is the child of two legendary strains: Jet Fuel and Gelato. Its effects tend to be euphoric and uplifting, leaving consumers both happy and still functional enough to get tasks completed.",
      "Immediately after smoking this powerhouse, users have described feeling a jolt of energy then leveling off into a dream-like euphoria. The flavor profile is also quite unique, combining the sweet, dessert-like taste of Gelato with the diesel aroma of Jet Fuel."
    ],
    "price": 150,
    "inStock": true,
    "type": "Hybrid",
    "tac": "25%",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "Sweet, dessert-like taste of Gelato with diesel aroma of Jet Fuel",
    "effects": "euphoric and uplifting, energy, dream-like euphoria",
    "supplier": "Compound Genetics"
  },
  {
    "title": "Gas Face",
    "images": [
      "/images/strains/gas-face/gas-face-3.jpg",
      "/images/strains/gas-face/gas-face-1.jpg",
      "/images/strains/gas-face/gas-face-2.jpg",
      "/images/strains/gas-face/gas-face-4.webp"
    ],
    "description": [
      "Gas Face will hit you in the face with her dank, pungent fuel aroma. Bred in the US by a very famous breeder, and from equally famous parent strains, it's no wonder that Gas Face is getting a lot of attention from both recreational and medical users.",
      "Gas Face is a very potent hybrid strain that produces around 25% THC and as high as 33%. Its dense, resinous flowers also contain a rich mix of terpenes, the most dominant being caryophyllene, limonene, and pinene."
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid",
    "tac": "25-33%",
    "length": "",
    "yield": "",
    "floweringTime": "±65 days",
    "terpeneProfile": "Dank, pungent fuel aroma",
    "effects": "Insomnia and sleep issues, stress, anxiety, depression, appetite loss, mood disorders, pain, inflammation, ptsd",
    "supplier": "Seed Junky Genetics"
  },
  {
    "title": "Fat Bastard",
    "images": [
      "/images/strains/fat-bastard/fat-bastard-4.webp",
      "/images/strains/fat-bastard/fat-bastard-1.jpg",
      "/images/strains/fat-bastard/fat-bastard-2.jpg",
      "/images/strains/fat-bastard/fat-bastard-3.jpg"
    ],
    "description": [
      "If you're looking for a strain that will really deliver come harvest time, make space for Blimburn Seeds' Fat Bastard. Fat Bastard pleases on many levels, including absolutely insane THC levels (30-38%). This plant is very adaptable in the grow room.",
      "As a cross between Gold member and Monkey Spunk, the former brings Indica-dominant genetics and pungent aromas to the table, and the latter offers skunky, berry flavors and energizing effects. A few puffs will quickly elevate your spirits and give you an energy boost."
    ],
    "price": 150,
    "inStock": true,
    "type": "Hybrid (Gold member x Monkey Spunk)",
    "tac": "30-38%",
    "length": "",
    "yield": "Indoor: 400-600 g/m², Outdoor: up to 900g per plant",
    "floweringTime": "8-10 weeks",
    "terpeneProfile": "Skunky, berry flavors, citrus notes, pungent",
    "effects": "Elevate spirits, energy boost, soothing and relaxing",
    "supplier": "Blimburn Seeds"
  },
  {
    "title": "Blackberry Moonrocks",
    "images": [
      "/images/strains/blackberry-moonrocks/blackberry-moonrocks-1.jpg"
    ],
    "description": [
      "Blackberry Moonrocks follows in the footsteps of other legendary and unique strains of our Seedbank. It was developed from a selected extremely potent female Blue Moonrock and a male Blackberry Kush, which has a particularly pronounced terpene and cannabinoid profile.",
      "This strain is not recommended for faint-hearteds and beginners, as its gigantic THC content of 32% and the extensive cannabinoid profile ensure long-lasting and very intense effects. The effect is mainly Indica dominant, very strong and is complemented by inspiring mood-enhancing Sativa effects."
    ],
    "price": 150,
    "inStock": true,
    "type": "80% Indica, 20% Sativa (Blue Moonrock x Blackberry Kush)",
    "tac": "33%",
    "length": "110-130cm",
    "yield": "550g/m² indoors, up to 700g per plant outdoors",
    "floweringTime": "8-9 weeks",
    "terpeneProfile": "Blueberry, lavender, blackberry with light citrus note",
    "effects": "Pain, anxiety, ms and sleep disorders, deep sleep, calming",
    "supplier": "Anesia Seeds"
  },
  {
    "title": "Sugar Cake",
    "images": ["/images/strains/sugar-cake/sugar-cake-1.jpg"],
    "description": [
      "Sugar Cake by Black Farm Genetics is a cross of Divorce Cake x Jungle Cake. This 60% Indica 40% Sativa has a flowering time of 8-10 Weeks. This specific composition suggests that Sugar Cake leans more towards the relaxing and sedating effects associated with Indica strains.",
      "The presence of Sativa genetics in Sugar Cake's lineage suggests that it may also offer some uplifting and energizing effects, which can help to balance out its relaxing qualities and provide a more well-rounded experience for users."
    ],
    "price": 150,
    "inStock": false,
    "type": "60% Indica 40% Sativa (Divorce Cake x Jungle Cake)",
    "tac": "22-26%",
    "length": "90-130cm",
    "yield": "400-550 grams per m2 indoors",
    "floweringTime": "8-10 weeks",
    "terpeneProfile": "",
    "effects": "Calmness, relaxation, sleep aid, uplifting and energizing effects",
    "supplier": "Black Farm Genetics"
  },
  {
    "title": "Kosher Kush Breath",
    "images": [
      "/images/strains/kosher-kush-breath/kosher-kush-breath-3.jpg",
      "/images/strains/kosher-kush-breath/kosher-kush-breath-1.jpg",
      "/images/strains/kosher-kush-breath/kosher-kush-breath-2.jpg",
      "/images/strains/kosher-kush-breath/kosher-kush-breath-4.png"
    ],
    "description": [
      "Kosher Kush Breath is a hybrid strain that has been reported to help patients with menstrual symptoms, mood stabilization, and anti-inflammation. A great strain for helping you get through the stresses of the daily grind.",
      "If you need a little afternoon pick me up, or you need something to help when it is that time of the month, Kosher Kush Breath has got you covered."
    ],
    "price": 150,
    "inStock": true,
    "type": "Hybrid",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "Menstrual symptoms, mood stabilization, anti-inflammation, stress relief",
    "supplier": "Hicks Ford Farm"
  },
  {
    "title": "Orange Velvet Underground Rbx",
    "images": [
      "/images/strains/orange-velvet-underground/orange-velvet-underground-1.jpeg",
      "/images/strains/orange-velvet-underground/orange-velvet-underground-2.jpeg",
      "/images/strains/orange-velvet-underground/orange-velvet-underground-3.jpeg",
      "/images/strains/orange-velvet-underground/orange-velvet-underground-4.jpeg"
    ],
    "description": [
      "(Sour Tangie x Mandarin Sunset) x Orange Velvet",
      "Orange Velvet Underground is a beast in all phases, with baseball-sized nugs. Dark purple is her most common hue, but cold temps make her colors more vibrant and dynamic—almost blue. Large, medium-dense kolas and side branching, baseball-sized nugs. Easily controllable and trained due to her strong lateral branching and vigorous, stacked apex growth."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "20-25%",
    "length": "",
    "yield": "Average",
    "floweringTime": "56-63 days",
    "terpeneProfile": "Orange spices, earthy, skunky",
    "effects": "",
    "supplier": "Ethos Genetics",
    "dateCreated": "2026-01-23T08:40:27"
  },
  {
    "title": "Blue Sherbert S1 Feminized",
    "images": ["/images/strains/blue-sherbert/blue-sherbert-1.jpg"],
    "description": [
      "Blue Gelato x Sunset Sherbert",
      "Alchimia is pleased to present Blue Sherbert S1 by The Plug Seedbank, an excellent choice for growers looking for a quality strain with exceptional aroma and effect. This variety is now available in our feminised cannabis seeds catalogue. Blue Sherbert S1 is the encounter between Blue Gelato and Sunset Sherbert, resulting in a highly rewarding growing and consumption experience. With its unique characteristics, this strain is perfect for those who want a bountiful harvest of dense, resinous flowers with fruity, sweet flavours. The perfect fusion, Blue Gelato and Sunset Sherbert come together in Blue Sherbert S1 Blue Sherbert S1 is the encounter between Blue Gelato and Sunset Sherbert. Blue Gelato genetic influence is noted by a vigorous growth and ease of cultivation. Its flowers are dense and covered in a thick resin layer, making it a visual spectacle. It is ideal to elaborate all types of extractions. It offers a complex aroma with fruity notes, such as blueberry and citric hints, with an earthy and floral background. It presents a high THC level, which results in an intense cerebral effect that gradually transforms into a relaxing sensation. On the other hand, Sunset Sherbert contributes with the ability to produce a large amount of trichomes. It is also an excellent choice for resin extractions. Its flavour combines citric notes with a sweet and earthy background, while offering an uplifting and euphoric effect on a mental level, while providing physical relaxation. Blue Sherbert S1 Strain cultivation, strong, easy, and full of black hues Blue Sherbert S1 plants present black hues in the foliage, making them visually striking and attractive. It is easy to cultivate, thus ideal for both novice and experienced growers. It is a strong medium-sized plant with medium internodal distance. Indoors it offers a flowering period of about 8-9 weeks, while outdoors it is ready to harvest in October. It delivers a high production, with a yield of up to 500-550 g per m2 indoors and equally abundant outdoors. Blue Sherbert S1 cannabis strain, experience sweet flavours and uplifting effects Blue Sherbert S1 will delight your senses with fruity and sweet flavours, complemented by a pleasant earthy background. The combination of citric, sweet, and earthy notes creates a unique and satisfying taste experience. In terms of effects, this strain offers a cheerful and euphoric experience on a mental level, providing an uplifting and energetic mood. At the same time, it provides a physical relaxation that helps to release accumulated tension and stress. Its high THC content ensures a powerful and long-lasting effect, perfect for creativity and socialising moments as well as for relaxation and rest. In short, Blue Sherbert S1 by The Plug Seedbank is a feminised cannabis strain with an excellent genetic potential. It is easy to cultivate, offers heavy yields and an exceptional taste and effect. It is an attractive option for growers in search of a rewarding experience. Do not miss the opportunity to cultivate and enjoy this exceptional plant in your garden."
    ],
    "price": 150,
    "inStock": true,
    "type": "Indica +60%",
    "tac": "High (15-25%)",
    "length": "",
    "yield": "High (500-600 g/m2)",
    "floweringTime": "Fast (9 weeks)",
    "terpeneProfile": "Fruity, Milky & Creamy, Sweet",
    "effects": "Relaxing",
    "supplier": "The Plug Seedbank",
    "dateCreated": "2026-01-06T12:24:48"
  },
  {
    "title": "Shiskaberry Strain",
    "images": ["/images/strains/shiskaberry/shiskaberry-1.webp"],
    "description": [
      "Blueberry x Afghan",
      "An indica-dominant hybrid created by crossing DJ Short Blueberry and Afghan. It features a sweet berry and earthy profile. Shiskaberry offers relaxing and calming effects with potential pain relief. THC content of 26%. Plants grow to 80-110 cm indoors and can yield up to 600-700g/m². Getting our Shiskaberry strain to this stage has been a complex work in progress for years, and we are delighted to finally introduce this unique and wonderful strain to our catalogue. The Shiskaberry strain is a unique experience. Her pungent, earthy, spicy notes leave a memorable, delicious aftertaste. Her beautiful berry scent will submerse you in a deeper dimension of delight and insight. The Shiskaberry strain is one stunning Indica that will put you where you need to be and keep you there."
    ],
    "price": 150,
    "inStock": true,
    "type": "100% Indica",
    "tac": "26%",
    "length": "80-110cm",
    "yield": "600-700 gr/㎡",
    "floweringTime": "50 – 55 days",
    "terpeneProfile": "Earthy, Spicy, Berry",
    "effects": "Happy, Relaxing, Creativity",
    "supplier": "Barney's Farm",
    "dateCreated": "2026-01-06T12:19:27"
  },
  {
    "title": "Mighty Grape Feminised",
    "images": [
      "/images/strains/mighty-grape/mighty-grape-1.jpg",
      "/images/strains/mighty-grape/mighty-grape-2.jpg",
      "/images/strains/mighty-grape/mighty-grape-3.jpg"
    ],
    "description": [
      "Mighty Grape is famous for its rich grapefruit taste, heavy yields and only 50 days of flowering time. In short, she is a fast, commercial and colourful lady. 100% Indica Fast flowering strain Commercial strain Medical cannabis seeds Mighty Grape feminised from Freedom of Seeds is a stable Indica cross of the two most delicious genetics: Dynamite and Grapefruit. Mighty Grape typically creates one main long-fat central cola and delivers heavy yields in only 45 – 50 days of flowering time indoors. She is our fastest strain with the highest commercial yields in such a short time. Buds of Mighty Grape are solid and compact. Although the flowers are heavy, the plant is so strong, that she requires little or no support. Mighty Grape does not have any special requirements for nutrients. In fact, she is so easy to grow that we recommend her to novice growers. Taste and effect of Mighty Grape The taste she inherited from her parents is incredibly grapefruity with a creamy hashy aftertaste. The high will hit you fast with pleasant, relaxing and calming effects accompanied by happiness and an uplifted mood. Mighty Grape as a herb Mighty Grape is often used in medicine to treat insomnia, chronic pains and fatigue. She is a relaxing medicinal strain suitable for nighttime use."
    ],
    "price": 150,
    "inStock": false,
    "type": "Indica Dominant",
    "tac": "18%",
    "length": "1.90 meters",
    "yield": "300 grams per 2 metre",
    "floweringTime": "7 – 8 weeks",
    "terpeneProfile": "Skunky, sweet, fruity, grapes",
    "effects": "",
    "supplier": "Freedom Of Seeds",
    "dateCreated": "2026-01-05T10:12:37"
  },
  {
    "title": "Raw Diesel",
    "images": ["/images/strains/raw-diesel/raw-diesel-1.jpg"],
    "description": [
      "Mexican Sativa x Afghan",
      "G13 Labs' Raw Diesel variety is the result of the union between Mexican Sativa and an Afghan plant. Its medium height and excellent organoleptic qualities make it an easy-to-grow plant. Its flowering period is between 60 and 70 days, and it is a heavy yielder: up to 950 g/plant outdoors of deep green, resinous buds. Raw Diesel has long, resin-covered tops of an intense, sweet smell – a complex fragrance composed of citric-mandarin and fruity notes, and a petrol amalgam. Raw Diesel seeds are also a good option for indoor cultivation, especially when the SOG and SCROG methods are used, up to 400 gr/m2 of luscious harvest can be expected. Moreover, the end product provides a long-lasting, cerebral effect. Perfect for enjoying an evening together with friends as it is highly stimulating yet balanced, allowing yourself to be carried along by its special aroma."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "12-16%",
    "length": "",
    "yield": "Indoor: 400 gr/m² | Outdoor: 900 gr/plant",
    "floweringTime": "60-70 days Indoor | mid/end October Outdoor",
    "terpeneProfile": "Petrol-like, Sweet, Exotic, Tangie",
    "effects": "Cerebral, Uplifting, Relaxing",
    "supplier": "G13 Labs Seeds",
    "dateCreated": "2026-01-05T10:06:07"
  },
  {
    "title": "Orange Cake",
    "images": ["/images/strains/orange-cake/orange-cake-1.webp"],
    "description": [
      "Tangie x Wedding Cake",
      "Experience the exceptional Orange Cake strain, a perfectly balanced hybrid with vibrant citrus flavors, uplifting effects, and potent genetics. Ideal for creativity, relaxation, and high yield cultivation!"
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "18% – 23% (Medium)",
    "length": "4.92 ft | 1.5 m",
    "yield": "High",
    "floweringTime": "8 – 10 weeks",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Blimburn",
    "dateCreated": "2026-01-05T10:02:06"
  },
  {
    "title": "Sour G R1",
    "images": ["/images/strains/sour-g/sour-g-1.jpg"],
    "description": [
      "Jet Fuel Gelato x (Sour D x Marshmallow OG)",
      "Fairly large flowers with spongy, dark green flowers with hints of purple. A little extra defoliation can be helpful."
    ],
    "price": 150,
    "inStock": false,
    "type": "Fem Photo",
    "tac": "22-27%",
    "length": "",
    "yield": "Heavy",
    "floweringTime": "63-70 Days",
    "terpeneProfile": "Sweet Floral, Gasoline and Pine, Hints of Candy",
    "effects": "",
    "supplier": "Ethos Genetics",
    "dateCreated": "2026-01-05T09:58:01"
  },
  {
    "title": "Frisian Duck",
    "images": [
      "/images/strains/frisian-duck/frisian-duck-1.jpeg",
      "/images/strains/frisian-duck/frisian-duck-2.webp",
      "/images/strains/frisian-duck/frisian-duck-3.webp",
      "/images/strains/frisian-duck/frisian-duck-4.webp",
      "/images/strains/frisian-duck/frisian-duck-5.webp"
    ],
    "description": [
      "Ducksfoot x Frisian Dew",
      "Frisian Duck is a hybrid cannabis strain known for its unique duck-foot–shaped leaves that help it stay unrecognisable as cannabis for much of its growth. It develops compact buds with a subtle, low-profile aroma of spice, forest, pine, and citrus, even as its striking purple flowers mature. The flavour is slightly fruity and piney with hints of berries or, in some phenotypes, a more citrus-forward profile, making it an uplifting choice ideal for morning or daytime use."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid with sativa-leaning bud structure; grows like a Christmas tree with compact Indica-style toughness",
    "length": "Medium to tall, Indoors: easily controlled, Outdoors: 2–3m tall, very large in good conditions",
    "yield": "Very high yielding (XXL), Indoors: ~400–500 g/m², Outdoors: extremely heavy harvest potential",
    "floweringTime": "7–9 weeks flowering; approx. 12–15 weeks seed to harvest",
    "terpeneProfile": "Subtle fruity, piney and spicy notes with hints of forest, citrus, berries; low odour and fresh aroma",
    "effects": "Mellow, uplifting, functional high; smooth, balanced effect ideal for daytime use and outdoor activities",
    "supplier": "Feminised Seeds",
    "dateCreated": "2025-12-10T11:24:46"
  },
  {
    "title": "Elvis",
    "images": [
      "/images/strains/elvis/elvis-1.jpg",
      "/images/strains/elvis/elvis-2.jpg"
    ],
    "description": [
      "Elvis is a prime selection from Seedism Seedbank in Amsterdam, leveraging insights from the Cannabis College. This AK47 hybrid is known for its potent effects and swift flowering period of 8-9 weeks. The genetic stability of AK47, combined with a quick flowering cycle, makes it a cornerstone in cannabis breeding efforts. Elvis combines the intense Sativa high of AK47 with the sweet, skunky notes of Skunk#1, resulting in a complex flavor akin to sweet and spicy mango chutney. This crossbreeding results in a plant that flowers quicker, exhibits a stout appearance, and promises high yields for knowledgeable growers."
    ],
    "price": 150,
    "inStock": false,
    "type": "Sativa dominant plant with Indica growth patterns",
    "tac": "21-24%",
    "length": "Medium length",
    "yield": "High yielding strain",
    "floweringTime": "8-9 weeks",
    "terpeneProfile": "Sweet and spicy mango chutney, sweet, skunky notes",
    "supplier": "Seedism",
    "dateCreated": "2025-11-05T08:38:20"
  },
  {
    "title": "Infatuation",
    "images": [
      "/images/strains/infatuation/infatuation-1.png",
      "/images/strains/infatuation/infatuation-2.png",
      "/images/strains/infatuation/infatuation-3.jpg"
    ],
    "description": [
      "Infatuation is one of the captivating strains from the exclusive Blue Power 10 Year Anniversary Limited Edition Line. To create this top-notch hybrid, a Jealousy BX was crossed with Blue Power IX2. Thanks to this connection, Infatuation boasts a 30% Sativa and 70% Indica genetic. Cultivators can anticipate bountiful yields ranging from 500 to 800 grams per square meter. Prepare to be smitten by the enchanting allure of Infatuation's unique character and remarkable flavors."
    ],
    "price": 150,
    "inStock": false,
    "type": "30% Sativa / 70% Indica (Jealousy BX x Blue Power IX2)",
    "length": "",
    "yield": "500-800 grams per square meter",
    "floweringTime": "55-65 days",
    "terpeneProfile": "Sour, gas, sherbert, gelato",
    "supplier": "SinCity Seeds",
    "dateCreated": "2025-11-05T08:34:03"
  },
  {
    "title": "Permanent Marker Seed",
    "images": [
      "/images/strains/permanent-marker/permanent-marker-1.jpeg",
      "/images/strains/permanent-marker/permanent-marker-2.jpeg",
      "/images/strains/permanent-marker/permanent-marker-3.jpeg",
      "/images/strains/permanent-marker/permanent-marker-4.webp",
      "/images/strains/permanent-marker/permanent-marker-5.webp"
    ],
    "description": [
      "Permanent Marker is a modern cannabis strain and is Leafly Strain of the Year 2023! Los Angeles indie brand Doja Exclusive released the Permanent Marker weed strain in 2022 on both coasts. Bred and grown by Seed Junky Genetics' JBeezy and selected by Doja Pak. The strain fuses several well-established cultivars: (Biscotti x Sherb Bx) x Jealousy. It can smell like a permanent marker. Others note its floral, soapy, candy, and gassy funk that fully translate into the taste. The potent strain smells amazing, and can support creativity or relaxation day and night."
    ],
    "price": 150,
    "inStock": true,
    "type": "Indica/Sativa hybrid ((Biscotti x Sherb Bx) x Jealousy)",
    "length": "",
    "floweringTime": "±70 days",
    "terpeneProfile": "Floral, soapy, candy, gassy funk, permanent marker",
    "effects": "Creativity or relaxation day and night",
    "supplier": "Junky Genetics",
    "dateCreated": "2025-11-05T08:30:46"
  },
  {
    "title": "Bubblegum Sherbet",
    "images": [
      "/images/strains/bubblegum-sherbet/bubblegum-sherbet-4.webp",
      "/images/strains/bubblegum-sherbet/bubblegum-sherbet-1.jpg",
      "/images/strains/bubblegum-sherbet/bubblegum-sherbet-2.jpg",
      "/images/strains/bubblegum-sherbet/bubblegum-sherbet-3.jpg"
    ],
    "description": [
      "Bubble Gum Sherb was developed from an extremely potent female, Bubble Gum x Sunset Sherbet, that has a particularly pronounced terpene and cannabinoid profile. Both parent plants were selected through a long process of searching for flavor and potency to finally obtain the properties we had envisioned. This strain is not recommended for the faint of heart or beginners as its extreme THC content of 30%-32% and the extensive cannabinoid profile ensure long-lasting and very intense effects. It gives us euphoric effects accompanied by body relaxation."
    ],
    "price": 150,
    "inStock": true,
    "type": "Mainly Indica (Bubble Gum x Sunset Sherbet)",
    "tac": "30-32%",
    "length": "",
    "yield": "Indoor: 450-550 gr/m² | Outdoor: 600-800 gr/plant",
    "floweringTime": "8-9 weeks",
    "terpeneProfile": "Berry, sweet, earthy, bubble gum aroma",
    "effects": "Stress, anxiety, sleep disorders, euphoric, happy, relaxed",
    "supplier": "Blimburn Genetics",
    "dateCreated": "2025-11-05T08:23:10"
  },
  {
    "title": "Jet Fuel Gelato",
    "images": ["/images/strains/jet-fuel-gelato/jet-fuel-gelato-1.jpg"],
    "description": [
      "Jet Fuel Gelato is the child of two legendary strains: Jet Fuel and Gelato. Its effects tend to be euphoric and uplifting, leaving consumers both happy and still functional enough to get tasks completed. Immediately after smoking this powerhouse, users have described feeling a jolt of energy then leveling off into a dream-like euphoria. The flavor profile is also quite unique, combining the sweet, dessert-like taste of Gelato with the diesel aroma of Jet Fuel."
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid",
    "tac": "25%",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "Sweet, dessert-like taste of Gelato with diesel aroma of Jet Fuel",
    "effects": "euphoric and uplifting, energy, dream-like euphoria",
    "supplier": "Compound Genetics",
    "dateCreated": "2025-11-05T08:14:16"
  },
  {
    "title": "Pineapple Express",
    "images": ["/images/strains/pineapple-express/pineapple-express-1.jpg"],
    "description": [
      "Experience tropical bliss with this potent hybrid, born from the union of Big Bud and Skunk genetics. The Pineapple Express is an Indica-dominant type that has been one of our best-selling strains for years! With its short flowering time, bountiful harvests, and high THC levels it is a favourite among growers. Expect large, resinous, heavy, and compact flower heads with both aroma and taste strongly marked with lemon and pineapple notes."
    ],
    "price": 150,
    "inStock": false,
    "type": "70% Indica | 30% Sativa",
    "tac": "17-22%",
    "length": "Medium length",
    "yield": "Indoor: 550 gr/m² | Outdoor: 950 gr/plant",
    "floweringTime": "50-55 days Indoor | early October Outdoor",
    "terpeneProfile": "Intense lemon, pineapple",
    "effects": "Intense, cerebral, relaxing",
    "supplier": "G13 Labs Seeds",
    "dateCreated": "2025-11-05T08:14:03"
  },
  {
    "title": "Caramba",
    "images": [
      "/images/strains/caramba/caramba-1.webp",
      "/images/strains/caramba/caramba-2.webp",
      "/images/strains/caramba/caramba-3.webp",
      "/images/strains/caramba/caramba-4.webp"
    ],
    "description": [
      "Lineage: Wappa x Gelato 33",
      "Ay Wappa!… Caramba is a fast flowering indica exotic which introduces a purple flourish to Paradise’s Wappa family. It comes with a big personality in the form of enhanced flavor, big yields and high levels of THC (24% THC). Caramba is ready to be harvested between 55 and 60 days and will yield about 600 grams per m² indoors or 900 grams per plant outdoors. This strain will be a hit with the many fans who have been seduced by the original Wappa, Tangerine Sorbet and Mendocino Skunk and delight those who are discovering the Wappa family for the first time, as Caramba stays true to the family values of the Wappa dynasty with its great resistance and superb all-round grow qualities."
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid | Indica 60%, Sativa 40%",
    "tac": "28%",
    "length": "",
    "yield": "",
    "floweringTime": "50 – 55 days",
    "terpeneProfile": "Gassy, Skunky",
    "effects": "Energizing / Uplifting",
    "supplier": "Paradise Seeds",
    "dateCreated": "2025-10-08T11:14:00"
  },
  {
    "title": "Frozen Tropicana Cherries",
    "images": [
      "/images/strains/frozen-tropicana-cherries/frozen-tropicana-cherries-1.jpg",
      "/images/strains/frozen-tropicana-cherries/frozen-tropicana-cherries-2.jpg",
      "/images/strains/frozen-tropicana-cherries/frozen-tropicana-cherries-3.jpg",
      "/images/strains/frozen-tropicana-cherries/frozen-tropicana-cherries-4.jpg"
    ],
    "description": ["Lineage:  Tropicana Cherry x BBC"],
    "price": 150,
    "inStock": true,
    "type": "Hybrid",
    "tac": "",
    "length": "",
    "yield": "Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Cherry, Gas, Funk",
    "effects": "",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-10-07T06:18:50"
  },
  {
    "title": "Sticky Glue",
    "images": ["/images/strains/sticky-glue/sticky-glue-1.jpeg"],
    "description": [
      "Sticky Glue is an unknown from In House Genetics and can be cultivated indoors and outdoors (Where the plants will need a flowering time of ±60 days) In House Genetics's Sticky Glue is only available as feminized seeds. Lineage: Gorilla Glue x Platinum Gorilla Flowering Time: 60"
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "In-House-Genetics",
    "dateCreated": "2025-10-02T20:06:43"
  },
  {
    "title": "Trichopath",
    "images": ["/images/strains/trichopath/trichopath-1.jpeg"],
    "description": [
      "Lineage: Platinum x Jelly breath",
      "Extremely frosty buds with a gassy funk and good yield."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "Medium – Tall",
    "yield": "",
    "floweringTime": "56-63 Days",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "In-House-Genetics",
    "dateCreated": "2025-10-02T20:06:43"
  },
  {
    "title": "Violet Cake",
    "images": ["/images/strains/violet-cake/violet-cake-1.jpeg"],
    "description": [
      "Violet Cake is an indica / sativa from Robin Hood Seeds and can be cultivated indoors, outdoors and greenhouse (Where the plants will need a flowering time of ±65 days) Robin Hood seeds. Robin Hood Seeds Description Wild berry Cake x (Grape Rock Candy x Banana Butter Cups) (Fems)"
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "63-65 days",
    "terpeneProfile": "Berries, Gas, Sour",
    "effects": "",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-10-02T20:06:43"
  },
  {
    "title": "Franco's Lemon Cheese",
    "images": [
      "/images/strains/francos-lemon-cheese/francos-lemon-cheese-1.jpeg"
    ],
    "description": [
      "GENETICS Super Lemon Haze x Exodus Cheese. EFFECTS Very stoned and long lasting, slow creeper. Medicinally effective in pain therapy, appetite stimulation and against insomnia. FLOWERING INDOOR 8 weeks, with a yield up to 800 gr/m2. Good for SCRoG. FLOWERING OUTDOOR FReady at the end of September (North hemisphere) with a production up to 800 gr/plant. Branchy plant with vine-like growth, needs full support. AWARDS 1stExpoGrow-Irún 2012, 2ndSpannabis 2013. Description Since the tragic loss of Franco Loja at the beginning of 2017, the world has been waiting for a strain dedicated to him. The strain that would represent Franco the best could only be his very last cross of two of his favorite plants: The multiple-cup-winning Super Lemon Haze and the famous Exodus Cheese. Green House Seed Co. is donating profits from the sales of Franco's Lemon Cheese to the Franco Loja Fund, which will help fund his children's education. Franco's Lemon Cheese has already won third place at the 2016 Spannabis Champions' Cup in the Outdoor category (under the name SLEX). The plant grows tall, with a strong main stem and long branches. It offers a mix of the Exodus's stretchy structure but with the greater compactness of the Super Lemon. The buds are round, medium-sized and rock-hard, covered in resin like those on the Super Lemon Haze, shining bright but with that extra skunky smell when you press the flowers. The branches might need support for the heavy buds. Franco's Lemon Cheese produces very dense buds covered in resin. The smell is very lemony, with hints of Cheese in the background. When smoking, the cheese flavor becomes more dominant on the exhale. The effect is very powerful, hitting fast and resulting in a very social and energizing high. The most expressed terpenes are Myrcene, Linalool, and D-Limonene."
    ],
    "price": 150,
    "inStock": true,
    "type": "60% SATIVA – 40% INDICA",
    "tac": "23.50%",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Green House Seed CO.",
    "dateCreated": "2025-10-02T20:06:43"
  },
  {
    "title": "Mozzarella",
    "images": [
      "/images/strains/mozzarella/mozzarella-1.jpeg",
      "/images/strains/mozzarella/mozzarella-2.jpeg"
    ],
    "description": [
      "Genetics and Background Mozzarella seeds by G13 Labs Seeds come from a carefully crafted cross of UK Skunk and Afghani genetics, resulting in a unique and flavorful cannabis strain that stands out for its distinctive aroma and taste. This balanced hybrid combines 60% Indica and 40% Sativa genetics, offering growers a well-rounded plant with reliable performance both indoors and outdoors. Mozzarella seeds are appreciated for their strong genetics, making cultivation a rewarding experience with consistently generous yields and resilient growth. Flavor Profile Mozzarella presents a truly distinctive flavor that immediately captures attention. Its taste is reminiscent of aged cheese, blending pungent skunky undertones with hints of earthy incense. This complex flavor profile offers a savory, rich experience that leaves a lasting impression on the palate. The cheesy notes are both bold and smooth, while the skunky accents add a layer of depth and intensity, making Mozzarella seeds highly sought after by those who enjoy unique and memorable cannabis flavors. Aroma The aroma of Mozzarella is equally captivating and unmistakable. Upon opening the buds, growers and users will notice a pungent blend of cheese, skunk, and incense. This potent fragrance fills the air with an inviting yet intense scent that lingers throughout the growing and curing process. The aroma profile is a signature trait of this strain, creating a sensory experience that sets Mozzarella apart from other cannabis varieties. Cultivation Details Mozzarella seeds thrive in both indoor and outdoor cultivation environments. Indoor flowering time typically ranges from 50 to 60 days, producing dense, resin-coated buds that are heavy with trichomes. Indoor yields are impressive, averaging around 500 grams per square meter, making it a productive choice for growers working with limited space. Outdoors, Mozzarella plants can reach medium to tall heights and are usually ready for harvest by early October. Outdoor growers can expect substantial yields, with some plants producing up to 1000 grams per plant under optimal conditions. The plant's adaptability and robustness make Mozzarella seeds a dependable option for a variety of cultivation setups."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "20%+",
    "length": "Medium to Tall",
    "yield": "500 gr/m2",
    "floweringTime": "50 – 60 days",
    "terpeneProfile": "Cheese, incense, skunk",
    "effects": "",
    "supplier": "G13 Labs Seeds",
    "dateCreated": "2025-10-02T20:06:43"
  },
  {
    "title": "Gastro Pop",
    "images": ["/images/strains/gastro-pop/gastro-pop-1.jpg"],
    "description": [
      "Gastro Pop was created from a cross of Apples & Bananas and Grape Gas—two strains also created by Chris Lynch. Below we'll shine a light on both parent strains. Apples & Bananas, Gastro Pop's first parent, is a beloved strain in its own right. Combining genetics from Now N Later and Jet Fuel Gelato, Apples & Bananas boasts deliciously fruity aromas with bold notes of, you guessed, apples and bananas, as well as hints of cherries and strong gassy overtones. Its flavor is also dominated by notes of apples and bananas, tied together with full-bodied and slightly earthy cookie/pastry notes. Apples & Bananas flowers are a little airy and spear-shaped, with stunning purple colors, and deliver a heavy head high with a light, relaxing body buzz. Gastro Pop's second parent, Grape Gas, is a heavy-handed indica-dominant strain that combines Grape Pie and Jet Fuel Gelato genetics. As its name suggests, Grape Gas has a dank aroma that couples sweet grape notes with pungent diesel overtones. Its flavor is similar, mixing grape with bold berry sweetness and a strong, sour note reminiscent of dank diesel. Grape Gas flowers have a very dense structure with a vibrant mix of bright green, deep purple, and fiery orange hues, all under a frosty layer of trichomes. Its effects are deeply relaxing, mixing a warm body buzz with an uplifting cerebral high. Gastro Pop is a very potent cannabis strain, producing between 23–30% THC."
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Compound Genetics",
    "dateCreated": "2025-10-02T20:06:42"
  },
  {
    "title": "Fabulozo",
    "images": ["/images/strains/fabulozo/fabulozo-1.jpeg"],
    "description": [
      "Fabulozo, crafted by StarFire Genetix, is a notable blend of Zoap and Permanent Marker strains, combining unique scents and flavors. This variety stands out for its exceptional qualities making it a must-have for those looking to enhance their garden with something truly remarkable. The parentage includes the well-received Permanent Marker, a mix of (Biscotti X Sherb BX1) X Jealousy F2 #5, known for its impactful presence in the cannabis community."
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid 50/50",
    "tac": "",
    "length": "",
    "yield": "Average",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Gassy",
    "effects": "",
    "supplier": "Starfire Genetics",
    "dateCreated": "2025-10-02T20:06:42"
  },
  {
    "title": "French Macaron",
    "images": ["/images/strains/french-macaron/french-macaron-1.jpeg"],
    "description": [
      "Facts about this strain:",
      "1st place for Best Indica at Expo Grow Irun 2017",
      "Gelato 33 x French Cookies",
      "Named after the delicate French treat, the Macaron. French Macaron by T.H. Seeds has melt-in-your-mouth potential and has more flavour and aroma than a boulangerie. The Gelato 33 French Cookies cross expresses the best traits of both parents and is the perfect cookie treat if you are looking for a quality indica with plenty to offer. About French Macaron Cannabis Seeds French Macaron is a feisty indica with a lot to offer. The plant is a Gelato 33 x French Cookies. The two strains get along like a house on fire and produce one of the tastiest indicas. This potent cannabis hybrid has so far only entered one cannabis cup but counts itself a winner. French Macaron won 1st place in the indica category at Expo Grow Irun 2017. Type French Macaron is a mostly indica photoperiod with a flowering time of 8-9 weeks. It is known to be a short plant with a high yield. You can buy French Macaron cannabis seeds online at the Amsterdam Seed Center in packs of 5. Appearance The structure of this plant is the perfect mix of Gelato 33 and French Cookies. French Macaron is a short plant with tightly packed calyxes erupting with so many trichomes it can be hard to see the beautiful, tight, dark purple bud underneath. Smell / Taste / Aroma The name of this one speaks for itself. Aromas of gas, musk and heavy cream come together, reminiscent of a sweet, creamy dessert. French Macaron is the perfect treat for your tastebuds and a worthy addition to the cookie line of cannabis genetics. Effect With a T.H.C. content >20%, you can expect to feel the full effects of French Macaron. Typical of an indica in many ways, this hybrid leaves you with a clear head while addressing any aches or pains. This one is potent but not overbearing and undoubtedly worth a try if you're a fan of cookie cannabis strains. Growing / Flowering Although a short plant with a flowering time of 8-9 weeks, French Macaron responds well to topping and L.S.T. (low-stress training). Good ventilation is a must with this one; whether grown indoors or outdoors, this plant will produce flowers so dense you will need to ensure they are getting fresh air flow. And French Macaron can be cultivated in any medium or culture, making it easy to grow whether you're soil or hydro."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "TH Seeds",
    "dateCreated": "2025-10-02T20:06:42"
  },
  {
    "title": "Mimosa",
    "images": ["/images/strains/mimosa/mimosa-1.jpeg"],
    "description": [
      "Mimosa is an indica / sativa from Symbiotic Genetics and can be cultivated indoors and outdoors (Where the plants will need a flowering time of ±60 days) Symbiotic Genetics's Mimosa is/was never available as feminized seeds. Symbiotic Genetics Description Mimosa by Symbiotic genetics is a rising star in the cannabis community. This strain has garderedn praise for its outstanding fruit puch, citrus rind aroma and pleasurable mid level buzz. Mimosa is a cross of Clementine and Purple Punch, and has been known to contain respectable percentages of the terpenes limonene and beta caryophyllene. Mimosa Awards Mimosa is a cupwinning variety from Symbiotic Genetics! 2nd Place for Phatpharms at the The Karma Cup 2019 - Sativa 4th Place for Brady Ranck at the The Emerald Cup 2018 - Outdoor - Private 3rd Place for Bamboo at the Santa Cruz Cup 2018 - Outdoor - Sativa 17th Place for Booney Acre Farm at the The Emerald Cup 2017 - Outdoor 4th Place for Pure Melt Rosin Ranch at the The Emerald Cup 2017 - Outdoor"
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Symbiotic Genetics",
    "dateCreated": "2025-10-02T20:06:42"
  },
  {
    "title": "Banana Buttercups",
    "images": ["/images/strains/banana-buttercups/banana-buttercups-1.jpeg"],
    "description": ["Banana Punch-Loki Gro Cut x PB & Jealous (REGS)"],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "Medium",
    "floweringTime": "56-63 days",
    "terpeneProfile": "Banana Peel, Sour, Woody, Skunky, Chocolate",
    "effects": "",
    "supplier": "Square One Genetics",
    "dateCreated": "2025-10-02T14:39:35"
  },
  {
    "title": "Marionberry Kush",
    "images": ["/images/strains/marionberry-kush/marionberry-kush-1.jpeg"],
    "description": [
      "Marionberry Kush is an mostly indica fromSubCool's The Dank and can be cultivated indoors and outdoors (Where the plants will need a flowering time of ±60 days) SubCool's The Dank's Marionberry Kush is/was never available as feminized seeds. Marionberry is a kush hybrid. Most phenotypes will grow as a typical short to medium kush, with a large broad leaf structure. Berries are the first thing that come to mind when describing the aroma of her. It is a true blend of a fruit salad aroma with a bit of musky funkiness that comes through, resembling her sister, Cinderella 99. The taste is smooth and fruity, with a clean, crisp, earthy exhale. Marionberry's high comes on quick, first feeling it behind the eyes, moving into the forehead. You can almost feel it tightening your eyebrows. Once the initial high has set in, it's a steady mild high great for day time activities with a true functionable experience.Phenotypes: There are six main phenotypes. All have similar fruit smells, some heavier than others with a range from passionfruit, raspberry, and a romulan earth under tone. Almost every phenotype will have some variation of purple, pink, and light green with drips of sugars."
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid (Raspberry Kush x Space Queen)",
    "tac": "",
    "length": "Short to Medium",
    "yield": "Medium to Heavy",
    "floweringTime": "",
    "terpeneProfile": "Phenotypes range from mango, passionfruit, to a raspberry lemonade and an earthy fruit smell. Very smooth, clear smoke with variations of berry after tastes to a musky kush sweetness.",
    "effects": "",
    "supplier": "SubCool’s The Dank",
    "dateCreated": "2025-10-02T14:18:45"
  },
  {
    "title": "Gelato 33 X Zkittles Cake",
    "images": [
      "/images/strains/gelato-33-x-zkittles-cake/gelato-33-x-zkittles-cake-1.jpg"
    ],
    "description": [
      "Originally bred by Seed Junky Genetics in collaboration with Jungle Boys and grown by Boobers Farm, this Indica-dominant hybrid, as it clearly states by its no-nonsense name, is a cross of two very tasty strains which both have an excellent lineage of their own – 'Gelato 33' and 'Zkittlez Cake'. Combining these two beauties unsurprisingly created an intensely delicious, moreish aroma and flavour profile. Speaking of which, when I first opened the bag I found my nose getting overwhelmed by a thick, sweet stream of candy notes and an underlying touch of gas. This was all wrapped up in a good layer of that undeniable creamy Gelato goodness. This wonderful blend of flavours making up the aroma translated over to the palate very nicely leaving me wanting more after every toke! The flavour I got from this flower was as well rounded as the aroma was, providing me with everything I want from a strain that has parents like this one does. A burst of that same, sweet Gelato creaminess came through immediately, accompanied by a deep gassy undertone. After a few tokes I started to taste a sweeter, fruity edge to it all, followed by a warm note of cake and baked goods. The effects were very well balanced and came on pretty quickly as I got about half way through the joint. I initially felt a slight bit of pressure behind my eyes as a wave of relaxation trickled down from my head to my toes, leaving me feeling very calm and comfortable sitting back listening to some tunes. I wasn't in a state of super couch-lock, but I certainly came close, so this one's definitely to be enjoyed in the evening!"
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Jungle Boys",
    "dateCreated": "2025-10-02T14:18:45"
  },
  {
    "title": "Chimera",
    "images": ["/images/strains/chimera/chimera-1.jpeg"],
    "description": [
      "Chimera is an unknown from Beleaf Cannabisand can be cultivated indoors and outdoors (Where the plants will need a flowering time of ±60 days) Beleaf Cannabis's Chimera is/was clone only available as feminized seeds. Beleaf Cannabis Description Chimera is a hybrid cannabis strain with an almost cult-like following. Treasured for her complex aromas and uplifting, energizing effects, Chimera makes for a standout daytime smoke. Read on to learn all there is to know about the Chimera cannabis strain. History of the Chimera Cannabis Strain Chimera is a strain most commonly attributed to BeLeaf Cannabis—a breeder based in Tulsa, Oklahoma. BeLeaf says he's had a passion for gardening since the age of 10 and admits to being introduced to cannabis at age 12 after finding his mom's stash of Mexican brick weed. After smoking it with some friends, it was love at first sight, and not long before BeLeaf started experimenting with growing the seeds contained in his mom's supply. As his passion for cannabis grew, BeLeaf found and preserved a wide pool of genetics, some of which he has been releasing through the BeLeaf Cannabis brand since 2015. Genetic Lineage of Chimera Chimera is a hybrid strain descending from White Truffle and The Creature. White Truffle, as its name suggests, has a dense, dank, and savory aroma. A phenotype of Gorilla Butter (Peanut Butter Breath x Gorilla Glue), White Truffle produces dark flowers with plenty of frosty resin. Its aroma is very strong and skunky, with upfront notes of cream, butter, and nuts. Its flavor, meanwhile, tastes like toasted onions sauteed in generous amounts of butter, and its smoke has an equally greasy, thick texture. Finally, White Truffle's effects can be felt almost instantaneously, producing a strong sense of mental relaxation that's quickly followed by a growing body buzz. Users with a tolerance might enjoy White Truffle in the evenings as they finish up chores or engage in creative activities, while less experienced users may prefer White Truffle closer to bedtime. The Creature, meanwhile, is a sativa-dominant strain bred by BeLeaf and sold under the Love Seeds moniker. Like many Love Seed strains, The Creature stems from a batch of seeds produced by plants that hermied in response to light failures at one of BeLeaf's off-the-grid farms. The Creature's exact lineage isn't known, but the strain is said to demonstrate strong sativa traits and produces long flowers with natural foxtails and tons of resin. The Creature's aroma is strong and fruity, with notes of peach and nectarines as well as an intense, gassy finish. Its effects are uplifting, starting behind the eyes and elevating the mood while simultaneously relaxing the body. Physical Characteristics of Chimera Chimera is a hybrid cannabis strain that produces stout plants with dark green foliage. As they transition out of veg, however, Chimera plants are known to stretch to almost double their height, adopting an impressive structure once mature. Generally speaking, Chimera flowers are a light wintergreen but, depending on the conditions in which they're grown, can also take on a stunning mix of purple, orange, red, and blue hues. Combined with their thick coating of trichomes (which could easily be mistaken for real, icy frost), this strain offers a ton of bag appeal. Properties and Effects of Chimera Chimera is known to be extremely potent and has received a lot of hype from users of all types for its strength and delicious aromas/flavors. Depending on the batch, Chimera can contain anywhere between 20–27% THC along with an exotic mix of terpenes. Limonene, caryophyllene, pinene, humulene, and guaiol tend to dominate Chimera's terpene profile, though the strain may also contain linalool and other common cannabis terps. Crack open a jar or bag of well-cured Chimera buds and you'll be greeted by a strong aroma of sugary, fruity cereal and jam. Below the sweetness, you'll also notice an upfront earthiness, almost reminiscent of wild mushrooms, moss, or crispy grilled waffle/pancake batter. Break apart Chimera's frosty nugs and take another big whiff as her subtler aromas of cream, skunk, and tobacco come to the foreground—some users compare the aroma of Chimera to that of a freshly buttered and jammed scone or biscuit. When you finally light her up and inhale Chimera's thick smoke or vapor, your palate will be hit by a complex mix of fruity sweetness, doughy earthiness, and lingering notes of zesty skunk."
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Beleaf Cannabis",
    "dateCreated": "2025-10-02T14:18:45"
  },
  {
    "title": "Bananium",
    "images": ["/images/strains/bananium/bananium-1.jpg"],
    "description": [
      "Genetic Lineage",
      "Bananium from the renowned breeder In House Genetics, crafted through the expert combination of two celebrated strains: Platinum and Banana OG. This hybrid leans heavily toward the indica side, with a composition of 95% indica and 5% sativa. The result is a plant that reflects the most desirable growth traits from both parent strains, delivering a powerful presence in the garden and a high resin output. Sold exclusively as feminized seeds, Bananium seeds ensure that growers will harvest only female, flower-producing plants, maximizing yield potential and efficiency. Flavor and Aroma One of Bananium's standout characteristics is its exceptional flavor and aroma profile. Upon consumption, a dominant hashy OG taste emerges first, offering a deep, earthy richness that grounds the palate. This robust base is smoothly accented by banana undertones that bring a sweet, creamy nuance to the experience. These flavors linger long after consumption, making Bananium particularly memorable. The aroma mirrors the flavor with an enveloping scent of hash and ripe bananas, combining to create a warm, inviting fragrance that fills any grow room or stash jar with a sweet, musky presence. Visual Characteristics Visually, Bananium makes a bold impression. The buds are dense and tightly packed, showcasing a frosty, sugar-coated appearance thanks to a generous coating of resin glands. These glistening trichomes not only reflect the plant's potency but also indicate its suitability for concentrate production. Under light, the crystalline surface of Bananium buds sparkles, adding to their bag appeal. The coloration can vary from deep forest greens to lighter tones, with vibrant orange pistils weaving through the flower, further enhancing its aesthetic allure. Indoor Cultivation Bananium seeds perform exceptionally well in indoor environments. Plants experience a moderate stretch during flowering, making them manageable in tents or smaller rooms. The flowering period typically spans 56 to 63 days. During this time, growers can expect the development of dense buds that are heavily coated in resin. With good cultivation practices and a stable environment, indoor yields tend toward the medium to heavy range. Training techniques such as topping and low-stress training (LST) are effective in promoting even canopy development and boosting yield. Outdoor Cultivation Outdoor cultivators will find Bananium to be a reliable performer across a variety of climate zones. The plant benefits from strong sunlight and thrives in well-draining soil. Its robust genetics make it resilient and adaptable, capable of producing high yields when provided ample space and attention. Outdoor Bananium plants typically reach maturity in late September to early October. Given sufficient growing space and favorable conditions, growers can expect a large harvest of resin-heavy, aromatic buds that maintain the strain's signature flavor and scent. Cultivation Tips Bananium is considered grower-friendly, making it a solid choice for both novice and experienced cultivators. Indoors, maintaining proper temperature and humidity during flowering will enhance resin development and preserve terpene richness. Employing training techniques helps optimize space and increase flower production. Outdoors, spacing plants well ensures airflow and light penetration, which are essential for healthy growth. Regular feeding and monitoring will support the plant's vigorous development throughout the season. Whether cultivated in soil or hydro, Bananium responds well to attentive care. Yield Potential Bananium seeds are known for producing medium to heavy yields, with results that vary depending on the environment and techniques used. Indoors, the yield can range from moderate to substantial, especially when growers implement effective canopy management. Outdoors, the yields can be particularly impressive, especially in climates that allow for full maturation of the dense, resin-rich flowers. The combination of flower quality and volume makes Bananium an excellent choice for growers interested in both personal use and concentrate production."
    ],
    "price": 150,
    "inStock": false,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "Medium to heavy",
    "floweringTime": "56 – 63 days",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "In-House-Genetics",
    "dateCreated": "2025-10-02T14:18:45"
  },
  {
    "title": "Grape Balls Of Fire Rbx",
    "images": [
      "/images/strains/grape-balls-of-fire/grape-balls-of-fire-1.jpeg"
    ],
    "description": [
      "GRAPE DIAMONDS x GRAPE CAKE x GRAPE STOMPER",
      "Grape Balls of Fire is SUPER terpy, with pungent aromas of grapes, gas, incense and berries. Her dense, round flowers are completely dripping in resin. Loves Outdoors Pungent Terpenes Vibrant Color Great for Extractions FEATURES: - Medium-sized, round plant with a strong structure. Lots of bud sites. - Easy to grow in any environment. - High bract-to-leaf ratio. Very easy to trim."
    ],
    "price": 150,
    "inStock": false,
    "type": "Fem Photo",
    "tac": "25%+",
    "length": "",
    "yield": "High",
    "floweringTime": "56-63 Days",
    "terpeneProfile": "Pungent Grapes, Gasoline, Incense, Hints of Berries",
    "effects": "",
    "supplier": "Ethos Genetics",
    "dateCreated": "2025-10-02T14:00:44"
  },
  {
    "title": "Platinum Kush Breath",
    "images": [
      "/images/strains/platinum-kush-breath/platinum-kush-breath-1.jpg"
    ],
    "description": [
      "Genetics: OGKB V2.1 x Platinum",
      "Created by blending OGKB V2.1 with Platinum, one of a kind strain which truly has it all; looks, bag appeal and flavour. Great for pain relief, anxiety and stimulating appetite."
    ],
    "price": 150,
    "inStock": true,
    "type": "Hybrid",
    "tac": "",
    "length": "Medium to tall stretch",
    "yield": "Med to heavy",
    "floweringTime": "60 – 75 days",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "In-House-Genetics",
    "dateCreated": "2025-10-02T14:00:44"
  },
  {
    "title": "Durban Poison",
    "images": ["/images/strains/durban-poison/durban-poison-1.jpg"],
    "description": [
      "Why should I get Durban Poison",
      "Classic, fully proven corner-stone variety",
      "Very tough and powerful genetics which are easy to grow",
      "Numerous side branches carry long and heavy flowers",
      "Resinous Sativa blooms with a unique terpene profile",
      "What does Durban Poison taste like?",
      "Durban Poison is a Sativa dominant strain with a unique, appealing aroma. It is known for its spicy, hazy taste with hints of aniseed, liquorice, lemon and cloves. This complex aroma is one of the reasons why Durban Poison has such a large following of repeat growers. Durban Poison Buds The buds of Durban Poison are very dense for a Sativa. Growers can expect vigorous plants with numerous side branches. Most phenotypes have the tendency to stretch greatly, so be aware if height restrictions in your grow room could be a potential issue. Durban Poison is a classic variety suitable for all conditions Durban Poison is a classic indoor and outdoor variety, tough enough for outdoor cannabis growing even in extreme Northern/Southern latitudes. Durban Poison seeds come originally from South Africa and were inbred over many years during the 70's. With each following generation, Durban Poison became increasingly adapted to the windy and rainy conditions of Northern Europe. Outdoor she has the potential to become really big. Heights above 3m are not unusual. Indoors she will stretch a great deal, so some form of height management is advised. Durban Poison strain info: The perfect all-rounder! Durban Poison is a pure landrace Sativa dominant variety which originates from South Africa. The plants may initially show wide Indica-style leaves. But during the latter part of the flowering period the growth pattern allows the Sativa dominance to show long flowers pierced by slim Sativa-style leaves. Durban Poison has become a corner stone strain in today's cannabis market. This Sativa dominant variety originates from the South African city of Durban and stood at the base of the famous GSC (Girl Scout Cookies) heritage/line, where strains such as Sherbet and Gelato were derived. Durban Poison is ready to harvest after around 8-9 weeks of 12/12 indoor bloom. Outdoors she can reach maximum heights of 3-4m and is harvested around early/middle Autumn. The genetics used to create Durban Poison ensure the following characteristics: A tough and vigorous plant. Easy to grow and suitable for all growing conditions A dense and slim Sativa style plant and bud structure A unique terpene profile with oversized resin glands Durban Poison is an old-school Dutch Passion classic. Available in both regular and feminized seeds. Durban Poison effects Durban Poison gained worldwide popularity due to its effects which are typically Sativa. It provides the user with a strong, uplifting and energising effect. It is the perfect strain to stay productive throughout the day or to complete creative tasks. It will put you in an elevated mood where you will still be able to face the outside world without feeling self-conscious or paranoid. The initial burst of energy can be followed by some more sedative effects if you smoke/vape larger amounts. The high is relatively long-lasting. How to grow Durban Poison We recommend a shorter veg period compared to most Indica's or Hybrid varieties if you are growing these plants indoors without the use of grow techniques to control height. Durban Poison tends to stretch a great deal, often doubling or tripling in size once in bloom. A veg period of 3-4 weeks should be sufficient to get decent sized plants. When growing with only a few plants on a m2 it is recommended to use the SCROG technique. When growing her outdoors, make sure there is ample space available because this lady can take over your garden plot! During early growth the plants can show more Indica-style leaves. A more sativa-style image and leaf appearance is seen during flowering. Indoor growers will notice the transition as soon as the light cycle is switched to 12/12. Outdoors as the days get shorter, the Sativa dominant heritage becomes more evident and her true colours appear. Stems are tough and durable. They can easily be manipulated without the risk of breaking. During early flowering is it recommend to do some leaf tucking. This puts the biggest leaves underneath the buds which they once covered. The flowering time is about 8-9 weeks. In combination with the recommended veg phase it will take around 11-13 weeks from seed to harvest. The yield of Durban Poison Durban Poison produces XXL harvests of old-school quality cannabis; between 450 and 650 grams per m2 is possible. The plant will carry heavy, resinous and dense buds. Our expert advice Durban Poison is a perfect strain if you are looking for a well known old-school favourite with heavy yields which is easy to grow both indoors and outdoors. This variety suits both beginners and expert growers. For indoor growing we recommend topping or fimming as it will increase the speed of the Durban Poison lateral growth. She will really shine when you use grow techniques such as LST, bending, supercropping and scrogging. This will increase yields greatly and it will make her height more manageable in an indoor environment. Make sure to give her enough root space. This will increase the speed of growth, as well as the eventual size and yield. More info about Durban Poison Durban Poison is one of Dutch Passion's classic varieties. It is a very tough and stable cannabis strain which will suit all types of grower. The flowering time is relatively fast for such a Sativa dominant variety. This was achieved by years and years of selective breeding. The calyx-to-leaf ratio is very high and the small sugar leaves are also covered in resin. Trimming is therefore fast and easy. The buds have a really distinct look and smell, something that you will not easily forget!"
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Dutch Passion",
    "dateCreated": "2025-10-02T14:00:44"
  },
  {
    "title": "Wedding Cake X Banana Butter Cups",
    "images": [
      "/images/strains/wedding-cake-x-banana-butter-cups-square-one-genetics/wedding-cake-x-banana-butter-cups-square-one-genetics-1.jpeg"
    ],
    "description": [
      "Wedding Cake x Banana Butter Cups strain seeds by Square One Geneticsblend the dessert-rich terpene profile of Wedding Cake with the banana-cream gas of BBC (Banana Butter Cups). This feminized hybrid produces dense, resin-soaked buds loaded with sweet, creamy, and gassy aromas, making it perfect for flower smokers and extractors alike. Wedding Cake x BBC grows into medium-sized, vigorous plants with thick branches and tight internodal spacing. Expect dense, frosty buds that showcase vivid green tones with purple accents under a blanket of shimmering trichomes. Its structure is ideal for SCROG setups, topping, and light training techniques. Flavour and Aroma Profile This hybrid delivers a delicious fusion of creamy vanilla frosting, banana cream pie, and gassy earth. Wedding Cake contributes its classic sweet vanilla richness, while BBC adds banana dessert terps and pungent funk. On the exhale, expect a smooth, creamy finish layered with subtle diesel notes. Effects and Medicinal Benefits Wedding Cake x BBC offers a balanced hybrid high that kicks off with a euphoric, happy buzz, eventually settling into calming, body-relaxing effects. It’s great for easing stress, anxiety, mild physical pain, and insomnia without leaving users overly sedated. A versatile strain perfect for afternoon and evening sessions. Growing Wedding Cake x BBC at Home This feminized strain flowers in 8–9 weeks and thrives in indoor, greenhouse, or controlled outdoor environments. It responds well to training, topping, and defoliation, rewarding attentive growers with moderate-to-high yields of top-shelf, resin-heavy buds. Its strong structure and heavy trichome coverage make it a great candidate for hash production."
    ],
    "price": 150,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Square One Genetics",
    "dateCreated": "2025-10-02T10:40:22"
  },
  {
    "title": "Nanaz",
    "images": [
      "/images/strains/nanaz/nanaz-1.jpg",
      "/images/strains/nanaz/nanaz-2.jpg",
      "/images/strains/nanaz/nanaz-3.jpg",
      "/images/strains/nanaz/nanaz-4.jpg",
      "/images/strains/nanaz/nanaz-5.jpg",
      "/images/strains/nanaz/nanaz-6.jpg"
    ],
    "description": ["NANAZ linage - RUNTZ X BANANA BUTTER CUPS"],
    "price": 150,
    "inStock": false,
    "yield": "Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Candy, Gas, Banana, Funk",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-06-10T12:07:27"
  },
  {
    "title": "Highway 66",
    "images": [
      "/images/strains/highway-66/highway-66-1.webp",
      "/images/strains/highway-66/highway-66-2.webp",
      "/images/strains/highway-66/highway-66-3.webp"
    ],
    "description": [
      "HIGHWAY 66 linage: L.A. AMNESIA X GELATO 33",
      "Highway 66 is a euphoric ride with finely tuned US and Dutch genetics behind the wheel. It’s a potent performer, with THC levels of 25%+, offering much for the palate of connoisseurs seeking new adventures in aroma and flavor. In the Paradise Seeds breeding tradition, Highway 66 is an upgrade on the L.A. Amnesia, a sativa which has been wowing growers since it was released as part of the Tommy Chong’s Collection a few years ago. Growers can expect to benefit from production stability with enhanced terpene and cannabinoid profiles. Highway 66 is a hybrid cannabis cross using a selected L.A. Amnesia x Gelato 33. The mother is the genetic provider of one of Paradise’s most popular sativas in recent years: L.A. Amnesia, which has been consistently popular with growers since its release in 2017 as part of the Tommy Chong’s Collection. The other parent is a selected Gelato 33 pheno, chosen to provide extra layers of potency and depth of flavor. Highway 66 is characterized by an exceptionally high Terpinolene profile alongside Limonene, Trans-ocimene, and Alpha Humulene. In the grow space, the smell is a fruity haze, discreetly pleasant and not overpowering. Once dried, buds emanate a pleasant floral fruitiness. The flavor features an underlying hazy taste on the inhale, with smooth, delicate floral perfume and a lemony sweetness that lingers on the tongue, accompanied by a hint of apples, attributed to the high percentage of Terpinolene. With THC levels tipping at 25%+, Highway 66 offers potency strong enough for experienced users, yet it’s far from overwhelming. The effect brings a calming euphoria that is uplifting, happy, and suitable for all-day use. Highway 66 is great for getting creative or exercising, with a quick onset and long-lasting effects that appeal to consumers of all levels. The calming, mood-lifting qualities of Highway 66 make it popular with users seeking all-day relief. Its friendly, easy-going effects make it also suitable for a wide range of medical users. Indoors: Highway 66 displays a typical hybrid growth pattern. While it’s easy to manage, its sativa genetics mean that careful handling is necessary in smaller grow spaces. Limiting the vegetative stage to 2-3 weeks helps prevent excessive stretch during flowering. Pruning is suggested in the veg stage to open up its growth structure and optimize bud production. Indoor Yield: 550g per m² Outdoors: When left to grow naturally, Highway 66 can exceed 2 meters in height in warmer, sunnier regions. It is resilient across a wide range of environmental conditions, from heat to humidity. In humid conditions, removing larger leaves at the mid-flower stage improves air circulation. Outdoor Yield: 1000g per plant"
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 25% Indica 75% Sativa",
    "tac": "26%",
    "length": ">120cm",
    "yield": "High",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Gassy, Skunky",
    "effects": "Stress, Pain, Calming & Mood lifting",
    "supplier": "Paradise Seeds",
    "dateCreated": "2025-06-03T09:09:38"
  },
  {
    "title": "Starburst (fresca Cut)",
    "images": [
      "/images/strains/starburst/starburst-1.jpeg",
      "/images/strains/starburst/starburst-2.jpeg",
      "/images/strains/starburst/starburst-3.jpeg"
    ],
    "description": [
      "STARBURST (FRESCA CUT) lineage: PLATINUM COOKIES X GRAND DADDY PURPLE X BLUE POWER X GELATI Pictures of our shade net grow, she performs well in an indoor, outdoor and greenhouse environment Super Frosty with Passion Fruit terps."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Passion Fruit",
    "supplier": "Starfire Genetics",
    "dateCreated": "2025-05-16T09:32:13"
  },
  {
    "title": "Frozen Blueberries",
    "images": [
      "/images/strains/frozen-blueberries/frozen-blueberries-1.jpg",
      "/images/strains/frozen-blueberries/frozen-blueberries-2.jpg",
      "/images/strains/frozen-blueberries/frozen-blueberries-3.jpg",
      "/images/strains/frozen-blueberries/frozen-blueberries-4.jpg"
    ],
    "description": ["FROZEN BLUEBERRIES lineage: BLUEBERRY X BBC"],
    "price": 150,
    "inStock": true,
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Blueberry, Funk",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-05-16T09:24:54"
  },
  {
    "title": "Mangonada Rosa",
    "images": [
      "/images/strains/mangonada-rosa/mangonada-rosa-1.jpg",
      "/images/strains/mangonada-rosa/mangonada-rosa-2.jpg",
      "/images/strains/mangonada-rosa/mangonada-rosa-3.jpg",
      "/images/strains/mangonada-rosa/mangonada-rosa-4.jpg"
    ],
    "description": ["MANGONADA ROSA lineage: FROZEN MANGO X LIMONADA ROSA"],
    "price": 150,
    "inStock": true,
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Tropical, Gas",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-05-16T09:20:20"
  },
  {
    "title": "Applecup",
    "images": [
      "/images/strains/applecup/applecup-1.jpg",
      "/images/strains/applecup/applecup-2.jpg",
      "/images/strains/applecup/applecup-3.jpg"
    ],
    "description": ["APPLECUP lineage: APPLE FRITTER X BBC"],
    "price": 150,
    "inStock": true,
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Apple, Funk",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2025-05-16T09:13:59"
  },
  {
    "title": "Grape Rock Candy Bx1",
    "images": [
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-1.jpg",
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-2.jpg",
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-3.jpg",
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-4.jpg",
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-5.jpg",
      "/images/strains/grape-rock-candy-bx1/grape-rock-candy-bx1-6.png"
    ],
    "description": [
      "GRAPE ROCK CANDY BX1 lineage: GRAPE ROCK CANDY X GRAPE ROCK CANDY X BANANA BUTTER CUPS"
    ],
    "price": 150,
    "inStock": true,
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Grape, Funky, Motor oil",
    "supplier": "Square One Genetics",
    "dateCreated": "2025-05-16T09:00:58"
  },
  {
    "title": "G - Rolls",
    "images": [
      "/images/strains/g-rolls/g-rolls-1.jpg",
      "/images/strains/g-rolls/g-rolls-2.jpg",
      "/images/strains/g-rolls/g-rolls-3.jpg",
      "/images/strains/g-rolls/g-rolls-4.jpg"
    ],
    "description": [
      "G-Rolls lineage: RUNTZ X GRAPE ROCK CANDY X BANANA BUTTER CUPS"
    ],
    "price": 150,
    "inStock": true,
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Grape, Candy, Sweet, Hint of gas",
    "supplier": "Square One Genetics",
    "dateCreated": "2025-05-16T08:51:02"
  },
  {
    "title": "Lilac Diesel Rbx2",
    "images": [
      "/images/strains/lilac-diesel/lilac-diesel-1.jpg",
      "/images/strains/lilac-diesel/lilac-diesel-2.jpg"
    ],
    "description": [
      "Lilac Diesel RBX2: (SLH x FORBIDDEN FRUIT) x (NYCD x CHERRY PIE) x (Citral Glue x ChemDi95) Easily trimmed and known for big yields, Lilac Diesel RBX1 is an obvious choice for any garden. Strong and aggressive with medium-length internodes and heavy lateral branching. Large, spongy-but-solid flowers. See how others have grown this strain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 50% Indica 50% Sativa",
    "tac": "25–30%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 -9 Weeks",
    "terpeneProfile": "Gassy, Floral, Sour Citrus",
    "effects": "Pain, Stress & Anxiety",
    "supplier": "Ethos Genetics",
    "dateCreated": "2025-03-27T07:40:32"
  },
  {
    "title": "Fat Banana",
    "images": [
      "/images/strains/fat-banana/fat-banana-1.jpg",
      "/images/strains/fat-banana/fat-banana-2.jpg",
      "/images/strains/fat-banana/fat-banana-3.jpg"
    ],
    "description": [
      "Fat Banana Lineage: BANANA X OG KUSH",
      "Fat Banana is a rare, top-shelf strain bred by RQS for cannabis lovers who want something special. A mix of OG Kush and Chiquita Banana, this potent indica-dominant hybrid packs a serious punch—with THC levels that can exceed 25% in the right hands! Growing Fat Banana Indoor Yield: 350-400g/m² under a 600W light. Flowering Time: 8-10 weeks indoors. Outdoors: In warm climates, it grows into a huge, heavy bush (ready by mid-September). Plant Structure: Despite being indica-dominant, it stretches more than usual, forming one massive main cola if left untrained. Support may be needed! Reward: Dense, resinous buds with a sweet banana aroma and extreme potency. High & Flavor Effects: It starts with a happy, euphoric buzz, but don’t be fooled—it soon turns into a deep, couch-locking stone. Perfect for relaxation (and serious munchies!). Taste & Smell: Sweet, fruity banana with a hint of citrus. The smell is so delicious that you’ll want to keep sniffing the jar! Images From Royal Queen Seeds."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 70% Indica 30% Sativa",
    "tac": "25%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8 -10 Weeks",
    "terpeneProfile": "Banana, Citrus, Earthy, Skunk",
    "effects": "Pain & Stress",
    "supplier": "Indica",
    "dateCreated": "2025-03-27T07:30:40"
  },
  {
    "title": "Supercheese",
    "images": [
      "/images/strains/supercheese/supercheese-1.jpg",
      "/images/strains/supercheese/supercheese-2.jpg"
    ],
    "description": [
      "Supercheese Lineage: CHEESE X CHEESE",
      "Supercheese by Positronics is one of the best Cheese strains you’ll ever try. It’s a mix of two top-quality Cheese plants, giving you a stable, easy-to-grow strain without losing the classic Cheese flavor. Whether you're a beginner or an experienced grower, Supercheese delivers great results. Smell & Taste: Supercheese has the strong, skunky, earthy-sweet smell that Cheese strains are famous for. The scent is powerful, so if you're growing in a busy area, you might need to take precautions. When smoked, it has a smooth, creamy, cheesy flavor that’s both relaxing and uplifting—perfect for unwinding or focusing. It’s also great for relieving stress, pain, and anxiety. Growing Info: Plant Size: Compact and bushy, with dense, resin-packed buds. Leaves: Few leaves, making harvest easier. They may turn slightly red near flowering. Hardiness: Tolerates some neglect, but better care means better results. Where to Grow: Works well indoors, outdoors, or in a greenhouse (just watch out for the strong smell!). Flowering Time: Fast—only 66-69 days for the best yields. Indoor Yield: Around 350-400g/m². THC: 19%—strong but balanced. Supercheese is a reliable, fast-growing strain that’s hard to beat! See how others have grown this strain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | Indica Dominant",
    "tac": "19%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "9 -10 Weeks",
    "terpeneProfile": "Earthy, Cheese & Sweet",
    "effects": "Pain, Anxiety & StresP",
    "supplier": "Indica",
    "dateCreated": "2025-03-27T07:18:03"
  },
  {
    "title": "Chocolate Haze",
    "images": [
      "/images/strains/chocolate-haze/chocolate-haze-1.jpg",
      "/images/strains/chocolate-haze/chocolate-haze-2.jpg",
      "/images/strains/chocolate-haze/chocolate-haze-3.jpg",
      "/images/strains/chocolate-haze/chocolate-haze-4.jpg"
    ],
    "description": [
      "Chocolate Haze Lineage: OG CHOCOLATE THAI X CANNALOPE HAZE",
      "This tasty genetic miracle is bred to grow strong and harvest early. Growers will delight in the ease and speed of production. The basis of these cannabis seeds is an OG Chocolate Thai plant carefully bred with all-star Cannalope Haze. These hybrid specimens have a low resistance to mould so take care in their initial development. They are guaranteed to be feminized to ensure production. A strain best smoked in the afternoon, a wandering mind will find a clear high with intellectual results when enjoying its flowers. High levels of THC and an airy sativa high fuel a cerebral effect that raises the mood and motivates the mind. This strain comes in handy before creative activities such as writing music or wielding a paintbrush. As a superb wake and bake strain, Chocolate Haze will augment your morning coffee to get your day started the right way. A member of the Haze strain family, Chocolate Haze is a sativa-dominant seed. It is 95% sativa and 5% indica. Haze seeds were originally bred in California in the 1970s before they were shared with the rest of the world and popularised in Amsterdam. Chocolate Haze seeds have up to a 20% THC content and the high is very powerful, even for the most experienced smokers. Experienced growers will reap 450-500 grams per plant in outdoor conditions when the harvest is dried. This resilient crop is easy to grow outdoors and should be ready in October to November. Grown indoors, Chocolate Haze cannabis seeds will give rise to plants reaching 160cm in height, whereas outdoor specimens can grow up to 200cm tall. The smoke of this strain has been described as fruity, light and underlined with a strong chocolate flavour. It will linger in the air and dance across the room. Users have described feeling briefly transformed to the nostalgia of the 1980’s as they let the soft smoke engulf their lungs and the chocolate flavours dance on their tongues. Images from Royal Queen Seeds"
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 5% Indica 95% Sativa",
    "tac": "20%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "9 -11 Weeks",
    "terpeneProfile": "Chocolate, Earthy, Fuity",
    "effects": "Arthritis, ADD/ADHD, Stress & Migraines",
    "supplier": "Royal Queen Seeds",
    "dateCreated": "2025-03-27T06:45:37"
  },
  {
    "title": "Triple Burger",
    "images": [
      "/images/strains/triple-burger/triple-burger-1.jpg",
      "/images/strains/triple-burger/triple-burger-2.jpg",
      "/images/strains/triple-burger/triple-burger-3.jpg",
      "/images/strains/triple-burger/triple-burger-4.jpg"
    ],
    "description": [
      "Triple Burger Lineage: GMO X DOUBLE BURGER",
      "Triple Burger is an indica-dominant hybrid strain (70% indica/30% sativa) created through crossing the potent GMO X Double Burger strains. Famous for its authentic, burger-like flavor, Triple Burger is the perfect tasty indica to help you feel calm and cozy before you finally settle down and head off to dreamland. Like we said, Triple Burger has a truly unique taste, with hints of creamy cheese, savory meat and rich spicy herbal sage. The aroma follows this profile, although it does add a new layer with a light touch of spicy diesel and chemicals. The Triple Burger high is one that will have you feeling cozy and ready to get to sleep after just one or two tokes. You'll feel a slowly building sense of calm begin to wash over you, easing away any bad moods and negative thinking immediately. This is accompanied by a light boost of happiness that gently helps the brain to finally rest. A cozy, warming sense encompasses you from start to finish, a feeling that can be a bit sedative at times. Combined with its super high 24-28% average THC level, these effects give Triple Burger a notable edge in treating experienced patients suffering from chronic pain, depression, chronic stress, appetite loss or nausea and ADD or ADHD."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 70% Indica 30% Sativa",
    "tac": "28%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8-9 Weeks",
    "terpeneProfile": "Ammonia, Butter & Blue Cheese",
    "effects": "Pain Relief, Sleep Aid & Migraines",
    "supplier": "Indica",
    "dateCreated": "2025-03-26T11:01:16"
  },
  {
    "title": "La Cheese",
    "images": ["/images/strains/la-cheese/la-cheese-1.jpg"],
    "description": [
      "LA Cheese Lineage: LA CONFIDENTIAL X BIG BUDHA CHEESE",
      "Winner High Times Cannabis Cup 2011 Amsterdam",
      "This strain is an amazing plant originally created with a multi-award-winning combination of 2 outstanding varieties of all time… our Big Buddha Cheese and the LA Confidential, an amazing Californian strain from our friends at DNA Genetics. This strain is an extremely potent indica plant, with solid dense nuggets and an extremely spicy OG Kush mixed with the ‘Old Skool Skunk’ taste of the Big Buddha Cheese. Over the years, Big Buddha has rebalanced the genetics of this strain by acquiring an authentic LA Kush male clone he chose himself directly from friends in California and now this strain is the best seed it has ever been, creating bigger yields and frostier nuggets…perfect for the connoisseurs of good marijuana! Look how others have grown this strain"
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 90% Indica 10% Sativa",
    "tac": "22%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Candy, Cheese, Skunk",
    "supplier": "Big Buddha Genetics",
    "dateCreated": "2025-03-26T10:51:10"
  },
  {
    "title": "Gelato 33",
    "images": [
      "/images/strains/gelato-33/gelato-33-1.jpg",
      "/images/strains/gelato-33/gelato-33-2.jpg"
    ],
    "description": [
      "Gelato 33 Lineage: SUNSET SHERBERT X THIN MINT GSC",
      "Origin",
      "Gelato 33 strain originates from the United States, a hotspot for high quality cannabis genetics. Known for its remarkable parentage, this strain combines Sunset Sherbet and Thin Mint Girl Scout Cookies. This American strain has rapidly gained popularity due to its potent effects and unique flavour profile. Cultivators in the US have access to Gelato 33 seeds, ensuring a high yield of female plants known for their dense, resinous buds. The genetics of the strain are a testament to the advancements in American cannabis breeding. Its lineage includes renowned strains like OG Kush and Durban Poison, contributing to its complex aroma and robust effects. American breeders continue to refine Gelato 33, making it a staple in the cannabis community for both recreational and medicinal use. Sunset Sherbet strain Sunset Sherbet is mostly indica hybrid cannabis strain with a delicious aroma. This strain has an intense sweet, citrus scent with a hint of berries. Its buds are small and dense, with a light green hue and an abundance of orange hairs. The high from Sunset Sherbet is known to be uplifting yet relaxing, with a strong body buzz. This strain has been known to provide relief from stress, anxiety, depression, and pain. Thin Mint Girl Scout Cookies strain Thin Mint Girl Scout Cookies is a hybrid strain that is a cross between OG Kush and Durban Poison. It is known for its sweet, earthy, minty aroma and flavour, with a hint of cocoa. It is a powerful strain that produces a strong, long-lasting body buzz and cerebral high. This strain is great for treating chronic pain, depression, stress, and nausea. It can also be used to induce appetite and help with insomnia. A combination of cannabis flower, cannabis concentrate, and terpenes are known for their depression, insomnia, and muscle spasm relieving properties. Gelato 33 is celebrated for its well rounded effects. Its hybrid nature provides a euphoric mental state, enhancing creativity and boosting mood. Simultaneously, it offers a gentle body relaxation, making it ideal for managing stress and mild pain. Gelato 33’s consistent effects have made it a favourite among both recreational and medicinal users. Its ability to induce a sense of calm without causing sedation makes it suitable for daytime and evening use, offering a delightful cannabis experience. Growing Gelato 33 Gelato 33 Feminized clones can be grown indoors or outdoors under optimal conditions, to avoid any problems during their development. Although they are compact and robust, moderately easy to grow and hardy, we should always prevent any pests. You can use different growing methods to retain and enhance the terpenes and flavours of your Feminized Gelato 33 buds. Use a quality substrate. Perlite, peat, or coco coir is ideal for moisture retention. Thanks to the experience of our customers with our Feminized Gelato 33 clones, we know that we can increase yields up to 20%. For optimal indoor cultivation, Blimburn Seeds advises wide, vertical spaces and the use of the ScrOG method to obtain a uniform plane and increase the size of the lower flowers. If you plan to grow our Feminized seeds outdoors, we have developed a grow guide for optimal cultivation in any area of the world. Remember that our cannabis plants also need good nutrients when our Feminized clones are in their vegetative period, and in their flowering period. When growing cannabis clones outdoors, choose the best date for your crop and a place where cannabis plants can receive the most hours of sunshine. If you would like to grow your clones indoors, be sure to have good tents, textile pots for growing, LED lighting, an air extractor to circulate clean air, and of course a good carbon filter to avoid problems with neighbours. Keep daytime temperatures between 20 & 26 degrees and night-time temperatures between 7 & 10 degrees cooler. Gelato 33 Feminized plants need low humidity to thrive. Keep relative humidity (RH) levels at 55%-60% during the vegetative phase. reduce RH to around 40% during the flowering phase. By harvest time, you can reduce RH to 30%. Depression relief: The appearance of the terpenes Caryophyllene and Linanool are triggers for the reduction of depressive symptoms, helps to have a great day. It is present in spicy, peppery, oregano, floral, lavender, mint, cinnamon, and coriander flavors. Insomnia relief: The combination of terpenes such as Myrcene, Terpineol, and high percentage of Linalool provides us with a sedentary and sleepy state. Pain relief: The appearance of the terpenes Myrcene and Humelene are triggers for pain reduction. When the terpene Eucalyptol is present, it is a great remedy for reducing chronic pain. It is present in earthy, musky, woody, and spicy aromas and in the terpene Eucalyptol Mint."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 55% Indica 45% Sativa",
    "tac": "25%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8-10 Weeks",
    "terpeneProfile": "Citrus, Pepper & Vanilla",
    "effects": "Depression, Pain Relief & Insomnia",
    "supplier": "Blimburn Genetics",
    "dateCreated": "2025-03-26T09:16:49"
  },
  {
    "title": "Forbidden Cake",
    "images": ["/images/strains/forbidden-cake/forbidden-cake-1.jpg"],
    "description": [
      "Forbidden Cake Lineage: WEDDING CAKE X FORBIDDEN FRUIT",
      "Forbidden Cake is a variety of feminized cannabis seeds from the American bank Elev8 Seeds, the result of crossing a Wedding Cake with a Forbidden Fruit. Wedding Cake has skyrocketed in popularity over the years for its incredible flavour. Wedding Cake, sometimes called the Pink Panties, is a modern hybrid with a balanced high and delicious flavour. It is a cross between the Cherry Pie and the famous Girl Scout Cookies. Wedding Cake has a profile of rich aromas with sour and acid touches, accompanied by a small creamy touch. Indoors, Wedding Cake finishes in about 9 weeks and can produce 500-600g/m², while outdoors it will be ready to harvest around October. Forbidden Fruit is the delicious cross of Cherry Pie x Tangie. This sumptuous genetic cross expresses a beautiful, dense bud structure with deep purple hues, deep green foliage, and orange hairs. The terpene profile is a perfect blend of Cherry Pie's musky and sweet cherry nuances and Tangie's strong tropical flavours. There are also notes of pine candy, mango and passion fruit, Forbidden Cake combines the terps of rotten fruit and candy with cookie gas."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "tac": "+25%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8-9 Weeks",
    "terpeneProfile": "Fruity, Candy & Cookies Gas",
    "supplier": "Elev8 Seeds",
    "dateCreated": "2025-03-26T09:02:34"
  },
  {
    "title": "Apricot Candy",
    "images": [
      "/images/strains/apricot-candy/apricot-candy-1.jpg",
      "/images/strains/apricot-candy/apricot-candy-2.jpg",
      "/images/strains/apricot-candy/apricot-candy-3.jpg"
    ],
    "description": [
      "Apricot Candy Lineage: DUTCH DRAGON X THIN MINT COOKIES",
      "Sweet Treat…  Apricot Candy is a California inspired strain which builds on the pedigree of a classic Paradise big yield sativa. The Paradise breeding team have focused their attention on bringing an added dimension to the high THC and full flavor value of traditional Cali weed strains, by enhancing the resin content and improving the yield potential. The unique flavor profile of Apricot Candy is one for the connoisseur. an extremely potent cannabis strain which oozes like a gourmet sweet dessert Apricot Candy combines Paradise Seeds heritage genetics with those of a modern-day legend. From the Paradise side the mighty (and multi-award winning) Dutch Dragon, with South African and Dutch genes at its sativa core. The other component comes from Thin Mint, a potent member of the Cookies family, which is responsible for its colorful terpene profile. The result is a plant that has stability and uniformity in its foundations, with the kind of extras which bring the maximum wow factor for the grower and consumer. Are you ready to make your mouth water? Apricot Candy is a flavor bundle which will resonate with the canna connoisseur who will love its unique taste and silky smoothness. Its terpene profile is dominated by caryophyllene which gives its funky flavor added kick! In the grow room there are hints of apple, fresh figs and apricots – sweet and fruity, like a fresh baked fruit pie. On the palate that sense of sweetness prevails with added notes of vanilla and ‘silky’ is the adjective that best describes the supreme smoothness of the taste. Difficulty Level: Medium Indoors : The sativa in Apricot Candy inevitably means this plant likes to stretch and this detail should be noted by those with limited height in the grow room who will need to restrain the dragon inside and keep those plants from going wild. However, the indica genetic element comes through in its sideways growth and in its chubby swollen buds. Outdoors: Outdoors, these plants grow like trees… In a Mediterranean climate, as expected, all that warmth and sun will fuel tremendous growth upwards and outwards. In northern regions growth will be less, but still expect the kind of specimen that could well be poking over the top of a neighbor’s fence. As flowering progresses the foliage takes on dramatic shades of vibrant reds, violets, and blues, bringing some excellent eye candy to admire during the growing stage. The sativa fueled growth and solid branch scaffolding is complemented by its indica infused bud growth pattern, producing chubby, swollen buds. Where this strain differs from many Cali varieties is the frosting supplied by the extra resin production qualities of this plant, illustrated by the trichome layer covering the flowers like the dump of fresh snow. Indoor Yield: 550 g per m² Outdoor Yield: 1000 g per plant Recreational: There is little waiting time with the effect of Apricot Candy, which arrives instantaneously with an immediate rush of energy. The + 20% THC content should come as a warning to the inexperienced, but the connoisseur will appreciate the enhanced sativa ascent – strong but clear – which lasts for half an hour or so before floating on dragon’s wings into a more relaxed Californian state of body and mind. Medical: This one is not a medical strain for inexperienced cannabis users who could find the potency too much to handle. However, the predominance of caryophyllene found in its terpene profile is associated with an enhanced ability to bind to CB2 receptors in the body’s endocannabinoid system with anti-inflammatory effects. See how others have grown this strain."
    ],
    "price": 150,
    "inStock": true,
    "type": "Fem Photo, Hybrid | 50% Sativa 50% Indica",
    "tac": "22%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Fruity and Vanilla",
    "supplier": "Paradise Seeds",
    "dateCreated": "2025-03-07T10:41:50"
  },
  {
    "title": "Belladonna",
    "images": ["/images/strains/belladonna/belladonna-1.jpg"],
    "description": [
      "Belladonna Lineage: SUPER SKUNK X MALAWI SATIVA F1",
      "Sultry Sativa… Belladonna is one of our original old school strains. This classic plant is a multi-award winner and is as popular now as when we introduced it 15 years ago thanks to a quick harvest time combined with sativa high. When we released it at the end of the Nineties it quickly became an overnight classic with growers in the USA, Spain and the Netherlands due to its commercial potential and outstanding forum reviews. It is a versatile plant that will adapt effectively well to most environments and repay the grower with a combination of strength and yield. A great plant to grow, Belladonna continues to be a popular choice with indoor growers with a flowering time of approximately 9 weeks. The ease of management and characteristic low maintenance makes it a good plant for beginners seeking a generous harvest and keeps old school growers coming back for more too. The buds are tight, and the foliage is reduced, giving this strain a good natural defense against mold and fungi. Belladonna is particularly recommended for growers with SOG set ups （Sea of Green）. This sultry sativa remains the seed of choice with many outdoor growers in both northern and southern regions. It does very well in warmer climates, such as California, where the sun fuels healthy growth, and was super popular when the outdoor growing revolution came to Spain in the 1990s. As this plant has been bred to be mold resistant, it is also a great bet （and a popular one） with sativa inspired gardeners in countries like the UK, Germany and the Netherlands. The resin coated buds that Belladonna delivers come with a heavy coating of trichomes, producing a plant that is beautiful to look at and fruity to taste. As for the effect, Belladonna produces a euphoria when smoked with a high that is psychedelic – trippy and hallucinogenic – provoking a strong rush to the senses. Belladonna – literally translated as ‘beautiful lady’ is a cross between Super Skunk – the famous Dutch strain which set the benchmark in the 1980s/1990s – and a potent male Malawi sativa (F1 hybrid) from the Paradise Seeds library. The result is a plant that is predominantly sativa but also comes with a significant indica influence – producing a unique long lasting and very powerful effect. Difficulty Indoors: A great plant to grow, Belladonna continues to be a popular choice with indoor growers with a flowering time of approximately 9 weeks. The ease of management and characteristic low maintenance makes it a good plant for beginners seeking a large harvest and keeps old school growers coming back for more too. The buds are tight, and the foliage is reduced, giving this strain a good natural defense against mold and fungi. Belladonna is particularly recommended for growers with SOG set ups (Sea of Green). Outdoors: This sultry sativa remains the seed of choice with many outdoor growers in both northern and southern regions. It does very well in warmer climates where the sun fuels healthy growth and was super popular when the outdoor growing revolution came to Spain in the 1990s. As this plant has been bred to be mold resistant, it is also a great bet (and a popular one) with sativa inspired gardeners in countries in northern and more temperate regions where Autumn brings more unpredictable weather. Recreational: The Belladonna cannabis seed produces a nicely balanced plant. The initial sativa effect is one of heady euphoria and uplifting energy, but the indica relaxation also comes into play as time passes, resulting in a long-lasting effect. Belladonna is also known for having a more mind-expanding effect than many strains. This makes it a popular choice for creativity and seeing a shifted view of the world, however it is not recommended for use by those who are prone to anxiety. Medical: Belladonna is not the best recommendation for medical users although there will be aspects that users will find therapeutic. * Winner 3rd prize Highlife Feria Barcelona 2005 See how others have grown this strain"
    ],
    "price": 150,
    "inStock": false,
    "type": "Fem Photo, Hybrid | 60% Sativa 40% Indica",
    "tac": "22%",
    "length": "Medium – Tall",
    "yield": "Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Fruity and Pungent",
    "supplier": "Paradise Seeds",
    "dateCreated": "2025-03-07T10:27:19"
  },
  {
    "title": "Dutch Dragon",
    "images": [
      "/images/strains/dutch-dragon/dutch-dragon-1.jpg",
      "/images/strains/dutch-dragon/dutch-dragon-2.jpg"
    ],
    "description": [
      "Dutch Dragon Lineage: AFRICAN SATIVA X INDIAN INDICA X SKUNK GENETICS",
      "Dutch Dragon is a big plant created by Paradise Seeds in the 1990s by balancing some land strains with a powerful skunk. But it's the African sativa that predominates in this sativa-dominant tree. She can grow up to 3 meters tall and with that comes a yield of a kilo per plant when grown outdoors. However, this often only happens in warm summers and dry autumns, or a Mediterranean climate. Indoor results of 500 grams per square meter are possible through ScrOG or Sea of Green setups. A typical bud of Dutch Dragon is long, sticky and contains around 21% THC that will quickly transport you to higher levels where you will be filled with positive energy. Dutch Dragon is one of the original Paradise Seeds strains developed in the 1990s (with some genetic tweaks a decade later). It’s a real powerhouse strain and a cosmopolitan mix of genetics from three continents. Under the hood is a raging African sativa engine, renowned for its fast acceleration in effect and sweet, citrusy flavor. To control its appetite for racing growth, Dutch Dragon also has mixed skunk and Indian parentage in the genetic melting pot. After one drag a nice up high is created that gives you energy. Therefore, very suitable for daytime use or to start off a night out. For medicinal use Dutch Dragon is great for putting a smile on your face and fighting pain. She contains a good amount of caryophyllene, limonene and of course THC. Up to 21% to be exact. That combination produces a flavor that leans more towards ripe tangerine than sour lemon. Difficulty Level: Medium Indoors: The Dutch Dragon has its fans in the indoor growing community. Because of its natural tendency to reach for the light (artificial and natural), this beast may be a challenge if your growing space is height restricted but is easily tamed with some training. If the indoor space is big enough to allow the beast to go for it, the result is fast and vigorous growth that yields very big. Outdoors: This is a great strain for the outdoor growing novice, especially for those gardening in the southern hemisphere. A Mediterranean climate and saturated sunshine are the right ingredients for plants to grow into mighty bushes (we have seen some as high as 3 meters). It’s in the genes! Outdoors, in the northern regions of the planet, the Dragon needs to be left until mid-October before cutting down. Dutch Dragon cannabis seeds produce a sativa plant that is renowned for its fat, long resinous buds which will swell significantly if left for an extra week or so during the flowering stage. As with many Paradise strains, the buds are surprisingly dense, gooey and super frosty with trichomes. Indoor Yield: 500 g per m² Outdoor Yield: 1000 g per plant Recreational: Users looking for high-performance classic sativa can stop their search right here. Dutch Dragon is a classic both unpretentious and unapologetic in its embrace of traditional sativa qualities. It unleashes a highly charged bolt of energy that is uplifting and soars to the clouds on the dragon’s wings. A great strain for daytime use and perfect for launching a night out on the town. Medical: The sativa uplift effect and accompanying boost of energy is favored by medical users who are seeking to lift dark clouds. Caryophyllene is also known for its pain relief properties. This is uplifting bud, a buzz that brings a big smile in the morning, allowing creativity to flow through the day while still getting things done and answering the phone. For the evening, its audio-visual enhancement powers will make your night sparkle. * Winner 1st prize Highlife Cannabis Cup 2006"
    ],
    "price": 150,
    "inStock": true,
    "type": "Fem Photo, Hybrid | 75% Sativa 25% Indica",
    "tac": "21%",
    "length": "Medium – Tall",
    "yield": "Extra Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Fruity and Sweet",
    "effects": "Pain relief & Uplifting energy",
    "supplier": "Paradise Seeds",
    "dateCreated": "2025-03-07T09:45:52"
  },
  {
    "title": "Blood Bath",
    "images": ["/images/strains/blood-bath/blood-bath-1.jpg"],
    "description": [
      "Blood Bath Lineage: BUBBLE BATH X RED VELVET",
      "Blood Bath by LIT Farms is an indica-dominant hybrid bred from the luscious pairing of Bubble Bath and Red Velvet. This feminized strain flowers in 8-9 weeks, offering reliable growth and potent effects. Blood Bath by LIT Farms is a bold and flavorful indica-dominant hybrid, showcasing the best of its premium genetics, Bubble Bath and Red Velvet. Known for its vigorous growth and dense, resinous buds, Blood Bath thrives in both indoor and outdoor settings. This feminized photoperiod strain flowers within 8–9 weeks, making it a convenient choice for growers seeking efficiency without compromising quality. The plants produce vibrant, trichome-coated buds that reflect their luxurious lineage, while their robust structure ensures adaptability to different cultivation techniques. Blood Bath is the perfect addition to any grower’s lineup, offering a combination of resilience, striking visual appeal, and powerful effects. Whether you’re cultivating for personal enjoyment or as part of a collection, this strain delivers a high-quality harvest every time."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "tac": "26%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Mochaccino, Nuts & Diesel",
    "supplier": "Indica",
    "dateCreated": "2025-02-11T11:55:34"
  },
  {
    "title": "King's Tart",
    "images": ["/images/strains/kings-tart/kings-tart-1.jpg"],
    "description": [
      "King's Tart Lineage: LA KUSH CAKE X BUBBA SLUSH",
      "Description",
      "The King’s Tart is an amazing new cross that will satisfy all dessert lovers. Two sweet and creamy strains have created the most flavourful pastry-like combination. First, we have the famous LA Kush Cake, selected from the Jungle Boys seed drop. This amazing mix combines the Kush Cake’s sweet-sour and creamy taste with the power and earthiness of the Kush Mint. On the other hand, we have the Bubba Slush, a combination of the Bubba Kush and Gelato, for that strong, creamy, and metallic profile. After combining those two strains, we obtained a beautiful and complex creamy explosion, with gassy notes that can remind you a little bit of the complexity of the Sunset Sherbert. It's an amazing and powerful terpene combination! The King’s Tart grows very vigorously, with an internodal length that will stretch by groups of 2–3 nodes if the plant is vegged for more than 2–3 weeks, making small groups of flowers that will stick together to make some rock-hard and extremely compact buds. The plant grows to medium size with a strong main cola surrounded by a lower crown of secondary branches that will equalize in size between them to form a beautiful canopy. Some phenotypes can be ready between weeks 7 and 8 if the conditions are optimal. The first flavour that will appear in the mouth on the inhale is the extreme sweetness and creaminess combination, with a touch of sourness, too, and on the exhale the metallic and earthy notes will be more dominant and stay in the mouth for a long time, a beautiful and mouth-watering strain. The most expressed terpenes are Myrcene, β -Caryophyllene, and Linalool. Effects The effects are strong and body relaxing, it will slowly rise as you smoke until it reaches its peak by the end of your joint. The first flavour that will come into the mouth on the inhale is the extreme sweetness and creaminess combination, with a touch of sourness too, and on the exhale the metallic and earthy notes will be more dominant and stay in the mouth for a long, a beautiful and mouth-watering strain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 80% Indica 20% Sativa",
    "tac": "26%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "7 – 8 Weeks",
    "terpeneProfile": "Sweet, Creamy & Earthy",
    "supplier": "Green House Seed CO.",
    "dateCreated": "2025-02-11T09:29:19"
  },
  {
    "title": "Purple Drank Breath",
    "images": [
      "/images/strains/purple-drank-breath/purple-drank-breath-1.jpeg"
    ],
    "description": [
      "Purple Drank Breath Lineage: PURPLE PUNCH X MENDO BREATH F2",
      "Purple Drank Breath Description",
      "If you enjoy a little sip of that purple drank here and there, why not also enjoy smoking it, too?! Well, we don’t mean that literally! This amazing tasting strain was named after its parents, the ever so popular Purple Punch and Mendo Breath F2, as well as is strong fruity flavours that are reminiscent of the lean beverage rather than actually being a by-product of it. A nicely balanced hybrid, Purple Drank Breath is top shelf, AAAA quality bud that truly has it all. Purple Drank Breath is an AAAA quality hybrid strain that is sure to please even the most seasoned cannabis connoisseur. It was named after its parents, the ever-popular Purple Punch and Mendo Breath F2, and has all the power and flavour you’d expect from such legendary lineage. Packing up to 26% THC levels and a balanced hybrid composition, this strain offers a heavy-hitting and relaxing experience that is soothing on both mind and body. Expect to be met with a slight tingling sensation that quickly transitions into a deeply relaxing and sedative high, leaving you couch-locked and ready to drift off into a peaceful sleep. Flavours & Aromas Purple Drank Breath is characterized by its tropical and citrus flavours and aromas, with hints of grapefruit, sweet and sour fruits, and even a hint of earthiness and herbs. Smoking this strain results in sweetness reminiscent of fruity candy, making it a great choice for those with a sweet tooth. Medical Benefits The Purple Drank Breath strain is a great choice for medical use, offering effective and deeply relaxing effects that can be used to treat chronic pain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 50% Indica 50% Sativa",
    "tac": "26%",
    "length": "Medium",
    "yield": "Medium – High",
    "floweringTime": "8 – 10 Weeks",
    "terpeneProfile": "Diesel, Berry & Spice",
    "effects": "Chronic Pain",
    "supplier": "The Plug Genetics",
    "dateCreated": "2025-01-31T07:51:24"
  },
  {
    "title": "Jessica Rabbit",
    "images": [
      "/images/strains/jessica-rabbit/jessica-rabbit-1.jpg",
      "/images/strains/jessica-rabbit/jessica-rabbit-2.jpg"
    ],
    "description": [
      "The Lineage of Jessica Rabbit: RED VELVET X TEMPTATION",
      "Red velvet is a variety originally created by Grandiflora Genetics by crossing between Lemon Cherry Gelato x Pina Acai. Used on several occasions by the breeder; This variety produces long, dense flowers with many voluminous, tight calyxes. The predominant colors are bright green and orange and some areas like dark purple and purple. Its aroma is a perfect floral, fruity and earthy balance. Temptation is a variety created by the breeder himself by crossing ice cream cake x Jealousy. The combination of two classic varieties created a spicier and more flavorful version and adding a bright part from Jealousy. The complex terpene profiles Gelato It provides slightly gaseous notes with soft notes of creamy cake."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | Indica Dominant",
    "tac": "18%",
    "length": "Medium",
    "yield": "Medium – High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Cheese, Earthy, Pungent, Sweet",
    "effects": "Anxiety, Arthritis, Depression, Migraines, Stress",
    "supplier": "Indica",
    "dateCreated": "2025-01-28T14:22:35"
  },
  {
    "title": "Chocolope",
    "images": [
      "/images/strains/chocolope/chocolope-1.jpg",
      "/images/strains/chocolope/chocolope-2.jpg",
      "/images/strains/chocolope/chocolope-3.jpg"
    ],
    "description": [
      "Chocolope Lineage: OG CHOCOLATE THAI X CANALOPE HAZE",
      "Chocolope DNA Genetics Description",
      "Chocolope seeds create a mouth-watering treat for cannabis enthusiasts, consumers, and cultivators. They’re easy to grow, produce impressively high yields, and deliver delectable flavours. The sativa-dominant hybrid boasts high THC levels and dynamic effects. It’s clear to see why this cultivar has won more than 10 awards, including the coveted High Times Strain of the Year in 2007. History and genetics Originally named D-Line, this cultivar had its debut in the 2000s as a tribute to the delectable chocolate strains of the 80s. It’s the result of crossing OG Chocolate Thai and Cannalope Haze, with further backcrossing to achieve a shorter flowering time. OG Chocolate Thai, an ancient landrace released in the 60s, gained popularity due to its delectable combination of bitter coffee and sweet chocolate. Their slow growth and predominantly male plants put this cultivar in high demand and hard to find. Cannalope Haze is the result of the original Haze and a Mexican landrace and is known to ease physical and cognitive tension. Chocolope leans more toward the former parent strain’s traits. Flavour and aroma profile Nugs grown from Chocolope seeds are typically large and heavy. These golden buds resemble a cylindrical shape with brown and green streaks and vivid orange pistils. Cured buds have an earthy aroma with a hint of sweetness that intensifies when lit. You’ll also experience undertones of coffee, pastry, and chocolate. History and genetics Originally named D-Line, this cultivar had its debut in the 2000s as a tribute to the delectable chocolate strains of the 80s. It’s the result of crossing OG Chocolate Thai and Cannalope Haze, with further backcrossing to achieve a shorter flowering time. OG Chocolate Thai, an ancient landrace released in the 60s, gained popularity due to its delectable combination of bitter coffee and sweet chocolate. Their slow growth and predominantly male plants put this cultivar in high demand and hard to find. Cannalope Haze is the result of the original Haze and a Mexican landrace and is known to ease physical and cognitive tension. Chocolope leans more toward the former parent strain’s traits. Flavor and aroma profile Nugs grown from Chocolope seeds are typically large and heavy. These golden buds resemble a cylindrical shape with brown and green streaks and vivid orange pistils. Cured buds have an earthy aroma with a hint of sweetness that intensifies when lit. You’ll also experience undertones of coffee, pastry, and chocolate."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 5% Indica 95% Sativa",
    "tac": "High %",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Sweet, Earthy & Chocolate",
    "supplier": "DNA Genetics",
    "dateCreated": "2025-01-20T13:35:40"
  },
  {
    "title": "Purple Cherry Ripple",
    "images": [
      "/images/strains/purple-cherry-ripple/purple-cherry-ripple-1.jpg",
      "/images/strains/purple-cherry-ripple/purple-cherry-ripple-2.jpg"
    ],
    "description": [
      "Purple Cherry Ripple Lineage:",
      "WEDDING CAKE X PURPLE CHERRY COOKIES",
      "Purple Cherry Ripple ancestors",
      "On the one hand Purple Cherry Cookies, a very famous variety for its cherry biscuit flavour that impregnates the taste buds unleashing a storm of flavours and aromas in the mouth. It also offers great power and a not-inconsiderable yield. On the other hand Wedding Cake, a more than famous variety that its growers only talk about. It has great potency, flavour and effect, a strain with high potential as a direct ancestor in many of the crosses currently available on the cannabis market. Purple Cherry Ripple cultivation Purple Cherry Ripple is an easy-to-cultivate plant, with excellent vigour both indoors and outdoors. It adapts well to most cultivation techniques such as SOG, SCROG, Topping, Mainlining, etc. It responds well to pruning and tying which makes it a good option for SCROG cultivation. It can also be cultivated in SOG using cuttings or by low pruning from seeds while controlling the plant's height. Cultivated outdoors it develops perfectly, reaching a good size provided by proper sun exposure and a high amount of substrate. A balanced nutrition with organic fertilisers promotes Purple Cherry Ripple's high-quality profile where cherry flavours and aromas are remarkable. Indoors it is a plant easy to cultivate and produces very compact, resinous and delicious buds. Its great aromatic power makes it advisable to use anti-odour systems to avoid being detected and the whole house smelling like ripe cherries. It offers a medium-high yield between 400-500g per m2 after about 8-9 weeks of flowering. It offers a very special flavour where a cherry base prevails with wood and earthy touches that provide a high-quality bouquet. Its effect is powerful, psychedelic and relaxing but without leaving the mind clouded. Consumed in low doses the effect is euphoric and blissful but if consumed a little more intensely, the effect becomes heavier and more intoxicating."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 70% Indica 30% Sativa",
    "tac": "+25%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Creamy Cookie & Hints of Cherry",
    "effects": "Stress & Muscle Relaxation",
    "supplier": "Indica",
    "dateCreated": "2025-01-20T12:18:59"
  },
  {
    "title": "Apples & Bananas",
    "images": [
      "/images/strains/apples-bananas/apples-bananas-1.jpg",
      "/images/strains/apples-bananas/apples-bananas-2.jpg"
    ],
    "description": [
      "Apples and Bananas' Lineage:",
      "BLUE POWER X GELATTI",
      "Apples and Bananas: A Taste Sensation That’s Simple to Grow",
      "With a sophisticated flavour profile, a straightforward cultivation process, and respectable yields, Apples and Bananas is a sought-after strain for growers of all skill levels. It is a testament to the hard work of Christopher Lynch and showcases the strengths of the Compound Genetics brand. It has even spawned several spin-offs, with an entire range of hybrids dedicated to the Apples and Bananas lineage. Provided you keep a close eye on plant structure during the early vegetative stage, there’s little reason you won’t be able to harvest a bumper crop of olive green buds. Against the backdrop of deep purple leaves, this strain looks just as impressive as it tastes. And with certain cultivars producing up to 30% THC, the head-focused, euphoric high is sure to please experienced users looking to test their limits. Compound Genetics Description Teeming with apple, pear, and tree fruit flavours, Apples and Bananas is a strain that not only helped establish Compound Genetics, but leaves users feeling euphoric and uplifted. Moreover, its hybrid genetics means the strain won’t overpower or leave you unable to function. Instead, it takes a more balanced approach, and this all-encompassing influence has earned Apples and Bananas a place on numerous dispensary menus. Strain History of Apples and Bananas Apples and Bananas is one of several strains that helped establish Compound Genetics, a rebrand of the now-defunct brand Tiger Trees (founded in 2016 by Christopher Lynch). The San-Jose-born cannabis breeder has spent over fifteen years honing his craft and, along the way, released highly sought-after strains such as Legend Orange Apricot, Jet Fuel Gelato, and in 2019, Apples and Bananas. However, Christopher didn’t start his career as a serial breeder. Instead, it took over a decade before he released his first official strain. Before that, Christopher spent two years in Amsterdam, the self-proclaimed cannabis hub of Europe. Here, he immersed himself in cannabis culture, before returning to the US with a newfound appreciation for the plant. It was only then, with the help of a friend, that he set up Tiger Trees and started experimenting with a combination of Chemdog D and Sour Diesel IBL. Tiger Trees wasn’t around for long, but it did pave the way for a more consumer-friendly brand, Compound Genetics. And it’s this label, with Christopher at the helm, that released the original Apples and Bananas strain. In fact, Compound Genetics has since launched an entire Apples and Bananas collection, including Apple and Bananas x Big Face, Apples and Bananas x White Runtz, and Apples and Bananas x Pavé. Genetic Lineage of Apples and Bananas Boasting an impressively frosty exterior, Apples and Bananas owes its trichome production, aroma, and uplifting high to two well-known parents—Blue Power and Gelatti. The former, a signature strain from Sin City Seeds, blends exceptionally well with the rather elusive Gelatti, a strain from the California-based seed bank Cookies. Blue Power features a diverse mix of terpenes, which is hardly surprising when you consider the strain is a cross of four different cultivars. Sour Double, Blue Moonshine, The White, and Master Kush all played a part in the lemon and berry flavours of Blue Power. Moreover, this rendition of Blue Power leans heavily into its indica-dominant genetics to produce a physically relaxing high that often leads to a severe case of the munchies. On the other side of the spectrum, we have Gelatti, a potent hybrid strain (Gelato x Biscotti) with a floral aroma complemented by hints of pepper and gasoline. Its flavour is very reminiscent of old-school OG strains, and long-time stoners favour her thick, haze-like smoke. She also offers a slightly different high to that of Blue Power, focusing on the mind (rather than the body) to produce wave after wave of happiness, creativity, and euphoria. Physical Characteristics of Apples and Bananas In the grow room, Apples and Bananas develops olive green, grape-shaped buds with a decent ratio of nugs to foliage. The green hues are complemented nicely by purple-tinted leaves and a generous helping of thin, electric orange pistils. To make the most of her colourful and occasionally unruly appearance, it’s best to adopt low-stress training techniques early during the vegetative stage. Doing so ensures you can maximize the number of bud sites. Outside of their distinct colouring, Apples and Bananas doesn’t possess any unusual physical characteristics. As such, she’s well-suited to beginner growers who want to get to grips with the basic structure of cannabis plants. However, if you want to emphasize the contrast of purple leaves against her olive green buds, consider running the night time temperature a few degrees cooler than during the day. Properties and Effects of Apples and Bananas Although Apples and Bananas’ appearance is somewhat conventional, her flavours (and the high that follows) are what keep recreational users coming back for more. It’s here she gets to showcase a combination of sugary bananas, sour red apples, cherries, and hints of pepper alongside an uplifting and euphoric experience, ideal for daytime smoking. That said, some cultivars have tested as high as 30% THC, so ensure you take a slow and steady approach to avoid being overwhelmed. Interestingly, she also boasts up to 2% CBD, which, combined with the high levels of THC, has earned her the respect of medicinal users. Thankfully, you don’t have to wait long for the strain’s effects to kick in, as just one puff lifts the mind into a state of euphoria. Uses of Apples and Bananas Given the sweet and fruity flavours of Apples and Bananas, it will come as little surprise that vaping is a particularly popular method of consumption. By carefully adjusting the vaping temperature, it's possible to accentuate the flavours, capitalizing on the strain’s abundance of terpenes. Myrcene is the most dominant, followed by pinene and caryophyllene, with the latter responsible for her peppery undertones and potential mood-boosting qualities. Another popular option is to turn Apples and Bananas' buds into rosin hash. The flowers are notorious for producing a generous layer of resin, and while rosin hash may not be the most efficient use of her buds, it makes for a flavoursome and ultimately potent experience thanks to her high THC content. Of course, you can always enjoy her the old-fashioned way and roll a large blunt. It may not be as sophisticated as vaping or rosin, but it’s still an excellent way to enjoy this tasty and uplifting strain. Cultivation and Production of Apples and Bananas Fortunately, the cultivation of Apples and Bananas is a simple affair. The strain doesn’t have any unique requirements and is happy being grown in soil or hydro. Her adaptability also makes her well-suited to beginners, although you’ll still want to consider low-stress training techniques such as screen of green (ScrOG) and sea of green (SOG) to maximize bud production. Left unattended, plants can become unruly, with a dense, intertwined canopy that limits light penetration to the lower branches. Even with a moderate approach to plant training, you can expect Apples and Bananas to flower in 7–8 weeks, while outdoors, plants should be ready to harvest in late September or early October. If you do have the space to cultivate outdoors, be prepared to support plants with extra bracing. Grown in a warm climate with plenty of sunshine, some examples have been known to reach heights of nearly two meters."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "tac": "25–30%",
    "length": "Medium – Tall",
    "yield": "Medium – High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Bananas, Sour Apple, Cherries & Spice",
    "effects": "Stress & Anxiety",
    "supplier": "Compound Genetics",
    "dateCreated": "2025-01-20T10:39:33"
  },
  {
    "title": "Honeycomb Pave",
    "images": [
      "/images/strains/honeycomb-pave/honeycomb-pave-1.jpg",
      "/images/strains/honeycomb-pave/honeycomb-pave-2.webp"
    ],
    "description": [
      "Honeycomb Pave is one of the newest strains to launch with us from the ever-popular breeders at Compound Genetics. This new strain is part of their Pave line, a three-way collaboration between Cookies, Compound Genetics & Quavo from the Migos rap supergroup. The mother is Big Face, a star-studded array blending two exotic heavyweights, the candy-gas-filled White Runtz hit with the raw Gelato powerhouse that is Jet Fuel Gelato. The Honeycomb Pavé is an Indica-dominant hybrid that typically tests at 23-27% THC content and generally finishes flowering between weeks 9 and 10. Honeycomb Pave is also typically a high-yielding cultivar. Pavé itself is a cross of the legendary Paris OG clone-only cut pollinated with Compound Genetics’ in-house creation of The Menthol which blends together Gelato #45 with White Diesel x High Octane x Jet Fuel."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | Indica Dominant",
    "tac": "23–27%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "9 – 10 Weeks",
    "supplier": "Compound Genetics",
    "dateCreated": "2024-09-13T09:55:53"
  },
  {
    "title": "Supreme Oreoz",
    "images": ["/images/strains/supreme-oreoz/supreme-oreoz-1.webp"],
    "description": [
      "Supreme Oreoz Genetic Lineage: GARY PAYTON X OREOS",
      "I know you're used to regular Oreos. Well, our Supreme Oreoz are much more delicious. They come from Starfire Genetics. Chocolate and Peanut butter. Smooth, creamy and relaxing. We think you'll like ours better than the Oreos you're used to. See how others have grown this strain."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 70% Indica 30% Sativa",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "supplier": "Indica",
    "dateCreated": "2024-09-13T09:14:52"
  },
  {
    "title": "Pure Michigan",
    "images": [
      "/images/strains/pure-michigan/pure-michigan-1.jpg",
      "/images/strains/pure-michigan/pure-michigan-2.jpg",
      "/images/strains/pure-michigan/pure-michigan-3.jpg"
    ],
    "description": [
      "Pure Michigan Genetic Lineage: OREOS X MENDO BREATH",
      "Pure Michigan is a rare indica dominant hybrid strain (70% indica/30% sativa) created through crossing the potent Oreoz X Mendo breath strains. Infamous for its super high level of potency, Pure Michigan is one delicious bud that will leave any indica lover feeling totally satisfied in both mind and body. This bud has a sweet and slightly spicy nutty chocolate flavour with a lightly creamy vanilla exhale. The aroma is very similar, with a sweet mocha coffee overtone accented by touches of earthy pungency and spicy nuttiness. The Pure Michigan high is just as delicious, with calming and soothing effects that will leave you feeling happy and lifted for hours on end. You'll feel happy and creative in this state, socially inspired and ready to carry on conversations with anyone and everyone around you with ease. A calming body high accompanies this heady lift, leaving you feeling fully relaxed from head to toe and slightly sleepy at times. In combination with its high 20% + average THC level, these effects make Pure Michigan a great choice for treating conditions such as depression, chronic stress, eye pressure or glaucoma, insomnia and headaches or migraines. This bud has fluffy grape-shaped olive green nugs with purple undertones, thin red-orange hairs and a coating of tiny purple-tinted white crystal trichomes. Growing Pure Michigan She displays a quintessentially indica growing pattern. Plants are medium in height but extremely bushy—the result of robust lateral growth and close branching. While her canopy requires frequent defoliation to allow for proper light penetration, this morphology lends itself to stealthy growing operations. Regarding flower structure, this strain produces dense and compact colas laden with sugar leaves. However, under some growing conditions, Pure Michigan will produce larger but more airy flowers. Although bigger, they’re less dense and look less impressive after trimming and drying. Pure Michigan buds are considerably frosty. Their massive THC content wouldn’t be possible without such an unusual trichome density. Together, these glands work overtime to churn out large quantities of THC and accompanying aromatic terpenes. Pure Michigan starts out as a deep green shade. During late flowering, however, plants start to develop hues of orange and purple. Thanks to her hardy genetics, Pure Michigan grows well in a wide variety of environments. Her compact stature also makes her a popular choice for growers with limited room to cultivate weed. Indoors, plants peak at around 70cm and produce up to 550g/m² after a brief flowering phase of 56–63 days. Plants reach a slightly taller height of 100cm outdoors when grown in raised beds or directly in the ground. Transplant seedlings into a sunny position for the best results. Amend your plot with plenty of organic matter, such as aged compost, to enhance the fertility of your growing medium and the productivity of your plants The Effects Purple Michigan hits hard and fast. It takes little more than a couple of hits for smokers with a low tolerance to feel her full effect. Even experienced smokers with an elevated tolerance will find that they need to inhale substantially less compared to other varieties. Joints and blunts offer a more controlled way of experiencing Pure Michigan. However, some smokers might enjoy hitting large bong bowls, or even consuming edibles made with these buds, for a far more pronounced effect. Regarding aroma and flavour, Pure Michigan is generally described as fruity and citrusy with a hint of ammonia! This latter note may seem odd or unappealing, but many stoners find it enjoyable. It’s worth noting that some smokers pick up on hints of vanilla and coffee in these buds as well, making for a truly complex flavour profile. Overall, the huge quantities of THC and stoning terpenes in Pure Michigan buds make her a strain suited for quiet evenings at home. She certainly doesn’t do much to keep smokers productive in the daytime, and will even tilt users toward a state of introversion at parties and social gatherings. Most users enjoy these buds while watching a film, listening to music, or shortly before bed. Medicinal application While many cannabis users smoke Pure Michigan for its recreational effects, some medical marijuana patients use this cultivar to address the symptoms of certain health issues. For example, medical cannabis patients with anxiety, pain, and sleep issues may choose to experiment with Pure Michigan. Though mild, Pure Michigan is capable of causing side effects, including lethargy, paranoia and anxiety (in higher doses), and dizziness. Thanks to her hardy genetics, Pure Michigan grows well in a wide variety of environments. Her compact stature also makes her a popular choice for growers with limited room to cultivate weed. Indoors, plants peak at around 70cm and produce up to 550g/m² after a brief flowering phase of 56–63 days. Plants reach a slightly taller height of 100cm outdoors when grown in raised beds or directly in the ground. Transplant seedlings into a sunny position for the best results. Amend your plot with plenty of organic matter, such as aged compost, to enhance the fertility of your growing medium and the productivity of your plants."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 70% Indica 30% Sativa",
    "tac": "29%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Chocolate, Earthy, Nutty",
    "effects": "Anxiety, Depression, Stress",
    "supplier": "Indica",
    "dateCreated": "2024-09-13T08:49:05"
  },
  {
    "title": "Granddaddy Purple",
    "images": [
      "/images/strains/granddaddy-purple/granddaddy-purple-1.jpg",
      "/images/strains/granddaddy-purple/granddaddy-purple-2.jpg",
      "/images/strains/granddaddy-purple/granddaddy-purple-3.jpg"
    ],
    "description": [
      "The original and some would say the best, Granddaddy Purple takes all that’s fantastic about purple strains to an entirely new level. Guaranteeing the ultimate all-round sensory experience, this bud beauty is as mesmerizing to look at as she is to smoke. Also stylized as Grand Daddy Purple, this hybrid is one of the most celebrated and popular purple strains of all time. Famed for incredible looks, a fabulous fruity flavour and face-melting high, this mauve marijuana has been reinvented and recreated thousands of times over the years. Though it has to be said that nothing comes close to the original. Strutting her stuff proudly for a good two decades now, Granddaddy Purple Feminized continues to set the bar for pretty much all other purple strains going. Averaging somewhere in the region of 20% THC, this Indica-heavy hybrid is potent enough to have you flat on your back indefinitely. Officially unleashed in 2003, this strain first appeared in the San Francisco Bay Area before going global. The legendary Ken Estes is famed for bringing this mighty hybrid to the masses, which immediately caught the attention of cannabis connoisseurs for her extraordinary looks (among other standout qualities, of course). With a genetic composition of approximately 80% Indica and 20% Sativa genetics, these buds are near-narcotic in their impact on the body. If you’re simply looking for something that gives you no choice but to relax and unwind, this one’s for you. Likewise, if you’re all about fragrance and flavour, there’s almost nothing else out there that compares to Granddaddy Purple Feminized. Growing While not the easiest strain to grow, cultivators’ efforts consistently feel more than justified - especially considering what you get back in return. Sticking with the feminized version will help you keep problematic male plants out of the equation, unless you’re working on your own hybrids. The fragrance of Granddaddy Purple Feminized is no less than a masterpiece. Exactly as her appearance suggests, you’re immediately enticed with a huge hit of juicy berries, grape candy and sugary sweetness. All with just the right amount of dank and skunky-funk in the background to keep things interesting. Break the buds open and all of the above is intensified, though with just a touch of exotic hash in the background. The flavour of is every bit as decadent as the fragrance, though with the added complexity of a little peppery spice. Fruity, refreshing and relentlessly satisfying, Granddaddy Purple pleases the palate on a level almost nothing else can compare to. As always, the debate rages as to whether these subtle nuances are best enjoyed via vaporization or traditional combustion. We’ll let you figure that one out for yourselves, though both come equally highly recommended. Effects ‘Overwhelming’ is the term that immediately comes to mind when describing the effects of this mauve marijuana superstar - though in this instance, with completely positive connotations. A couple of heavy hits and ‘heavy’ really is the word of the moment. You suddenly feel about five times weightier than you actually are, to such an extent that lifting even a finger becomes an arduous chore. This is the kind of strain you turn to when you actually want couch-lock, though coupled with an equally overwhelming sense of bliss and satisfaction. Interestingly, there’s none of the usual fogginess or mind-melt – this stuff keeps you sharp and clear enough to enjoy every second of the highly sedative experience. Massive cases of the munchies are practically inevitable, as is the prospect of eventually drifting off into an incredible night’s sleep with prolonged consumption. It doesn’t take a genius to figure out that Granddaddy purple is not a good daytime smoke. Save this stuff for chilled evenings at home and you’ll never look the same at an Indica-heavy hybrid again. Medical Uses of Granddaddy Purple For the most part, Granddaddy Purple is a pretty simple and self-explanatory strain in terms of medical applications. Despite being an Indica-dominant hybrid, there’s enough of a cerebral uplift to alleviate everyday stress, mild depression, anxiety and many other mental maladies aside. Nevertheless, it’s the physically sedating properties of Granddaddy Purple that make this specimen such a popular choice among therapeutic cannabis users. This stuff is capable of quickly and comprehensively numbing almost the entire body from head to toe. Perfect for anyone suffering from chronic pain, muscle aches, joint stiffness, headaches and the like. Unsurprisingly, Granddaddy Purple also makes light work of insomnia and similar sleep disorders – often making it practically impossible to stay awake. See how others have grown this strain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 80% Indica 20% Sativa",
    "tac": "23%",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Cheese, Earthy, Pungent, Sweet",
    "effects": "Anxiety, Arthritis, Depression, Migraines, Stress",
    "supplier": "Indica",
    "dateCreated": "2024-09-13T08:14:21"
  },
  {
    "title": "Uk Cheese",
    "images": [
      "/images/strains/uk-cheese/uk-cheese-1.jpg",
      "/images/strains/uk-cheese/uk-cheese-2.jpg",
      "/images/strains/uk-cheese/uk-cheese-3.jpg"
    ],
    "description": [
      "Lineage Genetics: SENSEI SEEDS SKUNK # 1 X AFGHANI # 1",
      "UK Cheese strain is the most popular strain to come out of the British Isles. A community of growers based around the Luton region in the area north of London, originally started growing this strain in the mid-1990s. UK Cheese is an especially pungent phenotype of the Sensi Seeds strain Skunk #1. This pheno has and average THC content of 17%-20% with less than 1% CBD. The terpenes are mostly all myrcene here which gives Cheese its extraordinary musky smell. Growers in the UK shared this strain all over the region throughout the years. Eventually it was exported to the EU continent where it quickly gained popularity in Amsterdam. It then eventually made its way to the United States in the late 90’s. History It was originally a Sensi Seeds Skunk #1 phenotype that exhibited an extraordinary smell of vintage Cheese. Maintained in clone form for many years by anyone lucky enough to get their hands on it eventually it was hybridized with Afghani #1 and seeds were produced. It quickly became one of the Top Ten strains sold in all the coffee-shops in Amsterdam and won numerous awards in the High Times Cannabis Cup. UK Cheese produces a well-balanced effect, a physical and cerebral mixture. Flavour & Aroma UK Cheese strain is famous for its pungent and funky cheesy smell like aged cheddar cheese that has been hanging around a cave full of skunks. There are also some fruity and spicy earthy notes. The taste is almost identical to its smell and leaves a spicy and tangy cheese flavour on the palate. The scent of fresh buds and the odour from the smoke is very strong so, be careful if using nearby others unless you want someone asking you for a taste. UK Cheese Effects The high produced by UK Cheese is fast-acting and begins as an energetic and carefree feeling. UK Cheese is evenly balanced with 50/50 indica to sativa. This makes cheese perfect for medical users who want a chilled relaxing but not sleepy experience. Cheese is popular for its effectiveness at fighting depression, migraines, and stress. Growing UK Cheese With an 8–9-week, indoor flowering time and lush heavy harvests UK Cheese seeds grow bushy and produces fat colas completely reeking of skunk and funk. Cheese thrives indoors but can also do well outdoors with low humidity and warm temperatures. The average outdoor yield is 16oz/plant and they should finish by mid-October. UK Cheese does very well using a screen of green (SCROG) method and is normally resistant to common moulds and mildew issues. The buds are light green coloured with orange hairs and a sticky coating of resin."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | Indica Dominant",
    "tac": "18%",
    "length": "Medium",
    "yield": "Medium – High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Cheese, Earthy, Pungent, Sweet",
    "effects": "Anxiety, Arthritis, Depression, Migraines, Stress",
    "supplier": "Sensei Seeds",
    "dateCreated": "2024-09-10T13:05:10"
  },
  {
    "title": "Cheese Cbd",
    "images": [
      "/images/strains/cheese-cbd/cheese-cbd-1.jpeg",
      "/images/strains/cheese-cbd/cheese-cbd-2.jpeg",
      "/images/strains/cheese-cbd/cheese-cbd-3.jpeg",
      "/images/strains/cheese-cbd/cheese-cbd-4.jpeg",
      "/images/strains/cheese-cbd/cheese-cbd-5.jpeg",
      "/images/strains/cheese-cbd/cheese-cbd-6.jpeg"
    ],
    "description": [
      "Genetic Lineage: CHEESE X PURE CBD",
      "Cheese CBD cannabis seeds show that with talent and elite genetics, there’s no wrong combination. Born from the cross of a Cheese and a Pure CBD, Cheese CBD kills the belief that cannabidiol-rich genetics always taste of orange. Thanks to the meticulous breeding work carried out by the technical team of Dinafem Seeds. Cheese CBD cannabis seeds show that with talent and elite genetics, there's no wrong combination. Born from the cross of a Cheese and a Pure CBD, Cheese CBD kills the belief that cannabidiol-rich genetics always taste of orange. Thanks to the meticulous breeding work carried out by the technical team of Dinafem Seeds, those who love the intense aroma of old cheese and Skunk will now be able to enjoy an equally smelly and tasty strain with a more moderate effect, perfect for daily use. Can you imagine enjoying all the taste and nuances of the best scotch but with a lower alcohol content? That's exactly what Cheese CBD offers all those who love the Cheese strain; an amazing plant that not in vain has ruled the world of cannabis in the UK for decades. Morphology The structure of Cheese CBD is very similar to the one of the original Cheese. Dense and compact plants with lots of branches, as a result of her Indica genes. Her Sativa side, inherited from the CBD predecessor, becomes evident in her thin and elongated leaves. But not only that. Her internodal spacing being a bit more ample means Cheese CBD is more resistant to moisture and plagues than the original Cheese. This is because that extra distance allows light and air to flow more comfortably, reducing the risks of fungal infections. When it comes to her size, Cheese CBD is a mid-sized/big plant that could reach heights of 2 m outdoors. Yield Just like the original strain, Cheese CBD is a heavy producer of large, elongated and sticky buds that boast a very special dark-green colour. Aromas and flavours Cheese CBD is a must-have for any self-respecting Cheese-lover. Her aroma is as thick, deep, complex and piercing as the one delivered by the original Cheese, with hints of flowers and an unmistakable Skunk basis that turns into a delicious aroma of cured cheese. Cheese CBD also adds a rather citric aftertaste to this explosive mixture that, despite being barely perceptible, tops it off masterfully, marvellously merging with the exceptional organoleptic qualities of the Cheese. Effects Thanks to her 1:1 THC:CBD ratio, Cheese CBD is more moderate and balanced than the original strain. This doesn’t mean Cheese CBD is not psychoactive at all. Just the opposite. It allows everyone to enjoy the typical psychoactive effects of cannabis, without having to worry about the mind-blowing potency of the original Cheese. Those users with limited tolerance to THC will be pleased to enjoy this legendary strain while more experienced consumers will have the chance to combine the high-THC Cheese and the high-CBD Cheese, depending on the situation. Cheese CBD delivers a moderately potent and long-lasting high, with a very nice sensation of well-being and happiness. On top of that, due to her high CBD levels, she showcases many anxiolytic and anti-inflammatory properties, among others. Cultivation Cheese CBD is very easy to grow and, thanks to her Indica-Sativa balance, she adapts perfectly to both indoors and outdoors. Given her moderate and homogenous horizontal growth, indoor growers will be able to make the most of the available space. However, they shouldn’t underestimate her vertical growth. In fact, to keep that under control, we recommend bending the top of the plant with the help of a thread and tying it up to the bottom of a tent. You must give serious consideration to the intense aroma of this strain, though. If you don’t want the entire neighbourhood to end up smelling of cured cheese, we suggest you buy some effective filters."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 50% Indica 50% Sativa",
    "tac": "8-10%, CBD 10-12%",
    "length": "Medium – Tall",
    "yield": "Medium – High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Floral, Skunk, Cured Cheese",
    "supplier": "DINAFEM Seeds",
    "dateCreated": "2024-09-10T12:46:12"
  },
  {
    "title": "Blue Rock Candy",
    "images": [
      "/images/strains/blue-rock-candy/blue-rock-candy-1.jpeg",
      "/images/strains/blue-rock-candy/blue-rock-candy-2.jpg"
    ],
    "description": [
      "Lineage Of Blue Rock Candy: GRAPE ROCK CANDY X BLUEBERRY FRITTER",
      "See how others have grown this strain"
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "tac": "25%",
    "length": "Medium – Tall",
    "yield": "Medium – High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Grape, Berries, Skunk",
    "supplier": "Indica",
    "dateCreated": "2024-09-10T12:26:34"
  },
  {
    "title": "Atomic Jelly",
    "images": [
      "/images/strains/atomic-jelly/atomic-jelly-1.jpg",
      "/images/strains/atomic-jelly/atomic-jelly-2.jpg",
      "/images/strains/atomic-jelly/atomic-jelly-3.jpg",
      "/images/strains/atomic-jelly/atomic-jelly-4.jpg",
      "/images/strains/atomic-jelly/atomic-jelly-5.jpg"
    ],
    "description": [
      "Atomic Jelly Genetics: JELLY BREATH x PLATINUM KUSH BREATH"
    ],
    "price": 125,
    "inStock": false,
    "length": "Medium",
    "floweringTime": "9 – 10 Weeks",
    "supplier": "In-House-Genetics",
    "dateCreated": "2024-08-28T09:42:58"
  },
  {
    "title": "Milky Dreams",
    "images": [
      "/images/strains/milky-dreams/milky-dreams-1.jpg",
      "/images/strains/milky-dreams/milky-dreams-2.jpeg",
      "/images/strains/milky-dreams/milky-dreams-3.webp",
      "/images/strains/milky-dreams/milky-dreams-4.jpg"
    ],
    "description": [
      "Milky Dreams genetics: MOTHER’S MILK X PERSIAN PIE",
      "The Milky Dreams is a mix of a selected Mother’s Milk from Bodhi Seeds, crossed with our Persian Pie and its powerful combination of lemon and banana flavours. This plant grows into a beautiful pine tree-shaped plant with a lighter colour of green, with compact flowers. The branches might need some help to hold the weight at the end of flowering if the plant is big! Effects The effect is strong but balanced, something in between a strong body feeling and an uplifting high from the fruity terpenes. A perfect smoke for people that like to be creative during the day, while being stoned. The secondary branches will grow strong and vigorous but will usually not overgrow the top of the plant, forming a beautiful shape. The compact flowers have a midsized calyx, and they are covered by resin, with a strong creamy and fruity aroma and some OG notes on the exhale. It leaves a very milky aftertaste in the mouth, with a hint of fruitiness, a pleasure for every sweet tooth. See how others have grown this strain"
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 60% Indica 40% Sativa",
    "tac": "25%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Fruity and Sweet",
    "supplier": "Green House Seed CO.",
    "dateCreated": "2024-08-28T09:13:12"
  },
  {
    "title": "Tarte Tatin",
    "images": [
      "/images/strains/tarte-tatin/tarte-tatin-1.jpg",
      "/images/strains/tarte-tatin/tarte-tatin-2.jpg"
    ],
    "description": [
      "Tarte Tatin Genetics: CARAMEL APPLE GELATO X KING’S TART",
      "The Tart Tatin is the new addition to the Green House Seed Catalogue. This beautiful plant is the result of the cross between the Caramel Apple Gelato from Compound Genetics, and our powerful King’s Tart. Expect to have plants with a nice caramelized vanilla-apple taste and a strong, creamy background. The Tart Tatin grow very vigorous, with a low leaf to flower ratio and medium-length internodes. The flowers can turn blue and purple during the final stage of the flowering time, with an incredible amount of trichomes. The effects are strong, fast hitting and will last for a while, giving a smooth body feeling and some light head buzz. A beautiful smoke from morning till nighttime. Effects The effects are strong, fast hitting and will last for a while, giving a smooth body feeling and some light head buzz, it also gives a good amount of energy to stay active during the day. The Tarte Tatin is the new addition to the Green House Seed catalogue, with a beautiful new expression of flavours and sweetness. We used the great Caramel Apple Gelato, selected from Compound Genetics for its beautiful calyx structure and potent smell, and crossed it with our extremely sweet and powerful King’s Tart. Combining both tastes in a beautiful explosion of flavours that can be compared to the famous Tarte Tatin dessert, a strong caramelized vanilla-apple taste with a background of cream and chocolate, that reminds the old times of the Chocolope, but with a newer touch. The apple and vanilla on top of it, and finally a light creaminess will complete the flavour, like a hint of Chantilly cream on top of your Tarte, beautiful! The Tarte Tatin grows very vigorously and has a low leaf to flower ratio, forming beautiful flowers with a very low number of leaves inside, making it a treat when trimming time comes! The plants kept the big calyx structure from the C.A.G, with even more trichome production induced by our King’s Tart. The result is a beautiful and aesthetic flower that will stretch with medium-length nodes, forming flowers all along the stem without closing up together. At the end of flowering, each flower site will develop its own beautiful bud. It does not have a big flowering stretch and will double its size once in the flowering phase, with medium-sized stems that will stand straight, pointing at the sky. By the end of flowering, some phenotypes can express some beautiful blue and dark purple hues, inherited from the Caramel Apple Gelato’s colourful flowers. The taste of the caramel apple gelato is very smooth, ranging from the caramelized apple taste to that sweet vanilla chocolate, and finally, a hint of creaminess it will fill your mouth with its sweetness. A beautiful smoke from morning till nighttime."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 65% Indica 35% Sativa",
    "tac": "26%",
    "length": "Medium – Tall",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Caramel, Vanille-Apple, Creamy Chocolate",
    "effects": "Fatigue relief, Pain and Stress",
    "supplier": "Green House Seed CO.",
    "dateCreated": "2024-08-28T08:12:14"
  },
  {
    "title": "Violet Bag",
    "images": [
      "/images/strains/violet-bag/violet-bag-1.jpg",
      "/images/strains/violet-bag/violet-bag-2.jpg"
    ],
    "description": ["See how others have grown this strain."],
    "price": 125,
    "inStock": true,
    "type": "",
    "tac": "",
    "length": "",
    "yield": "",
    "floweringTime": "",
    "terpeneProfile": "",
    "effects": "",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2024-08-21T09:20:05"
  },
  {
    "title": "Frozen Bag",
    "images": [
      "/images/strains/frozen-bag/frozen-bag-1.jpg",
      "/images/strains/frozen-bag/frozen-bag-2.jpg",
      "/images/strains/frozen-bag/frozen-bag-3.jpg",
      "/images/strains/frozen-bag/frozen-bag-4.jpg",
      "/images/strains/frozen-bag/frozen-bag-5.jpg"
    ],
    "description": [
      "MICHIGAN GAS FACTORY CUT X BANANA BUTTER CUPS",
      "See how others have grown this strain."
    ],
    "price": 150,
    "inStock": false,
    "type": "Fem Photo, Balanced Hybrid | Sativa Dominant",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Gas, Chemical",
    "supplier": "Robin Hood Genetics",
    "dateCreated": "2024-08-21T08:59:43"
  },
  {
    "title": "Jelly Donutz",
    "images": [
      "/images/strains/jelly-donutz/jelly-donutz-1.jpg",
      "/images/strains/jelly-donutz/jelly-donutz-2.jpg"
    ],
    "description": [
      "JELLY DONUTZ X HELLA JELLY X WHITE RUNTZ",
      "Welcome to the world of dessert strains and delicious flavors. Jelly Donutz is a tasty little morsel with high potency that is sure to delight the palate of smokers of all consumption habits. It will also satisfy growers looking for a fast-flowering plant that provides a huge yield. Here is what you should know about Jelly Donutz, how it grows, as well as how it smells, tastes, and feels. Bred by Humboldt Seed Company (HSC), Jelly Donutz is a sativa-dominant hybrid (40% indica, 60% sativa) that was born from crossing Jelly Donutz (#160x#17), Hella Jelly, and White Runtz. Just in reading that, you can probably smell and taste the thought of Jelly Donutz. That’s because its genetics scream fruit, dessert, and Gelato descendance. Jelly Donutz Flavour Pofile Thanks to its Gelato and Zkittlez lineage, but also comes through with floral, creamy, and diesel notes on the exhale.  Runtz and White Runtz are both strains that have been faked, forged, and scammed thousands of times, due to their popularity. Companies know how in-demand the strains are so they will take a plant that is NOT Runtz, and still package and market that strain as such. Fortunately, with HSC, you’ll never have to worry about that. If they say a strain is Runtz, or is crossed with Runtz, you can bet your bottom dollar that it’s the truth. Made from a cut of Runtz that Humboldt Seed Company obtained at the famous Emerald Cup, Jelly Donutz is a perfect example of that. Jelly Donutz’ purple and green flowers are absolutely coated in trichomes, which makes it a great strain to wash for concentrates. Its THC content has tested as high as 35%. Tetrahydrocannabinol (THC) is the active compound in cannabis that turns you from sober to “high. This strain is the perfect mix of sweet candy and fuel terpenes. HSC describes its smell profile as pink cotton candy, caramel, and fuel. As far as flavor goes, smoking Jelly Donutz tastes like drinking a strawberry malted milkshake. The High Consumers can typically expect an energizing and upbeat type of high from this strain. That’s why it’s such a great strain for anytime consumption. Whether you wake-and-bake with it, smoke it during an afternoon break, or reserve it for an evening chill-out, you’ll still sure to enjoy the experience that follows. For people looking for something to smoke and enjoy active hobbies, say hello to Jelly Donutz. “The high from buds harvested at day 56 lived up to HSC’s promise of 30-35% THC. The onset of the high was heart-racing, mostly Sativa, but not annoyingly paranoid or anxious, and the high lasted hours without burnout,” says Growing Marijuana Perfectly. “This high is great for dancing, athletics, parties…but novice users should inhale with caution. Even those of us who wake and bake and keep baking all day long notice that this strain takes you right through the ceiling, no matter how high you were before,” they continue. Jelly Donutz tends to be more of a head high than body high for consumers. It hits your brain with an energy rush that then spreads the same energy throughout your body; but that initial cerebral onset is undeniable. Still, even with this knowledge of average user experience, the best way to know how Jelly Donutz will affect you is to consume the strain in various doses and settings then monitor the experience over a period of 2-5 hours. So get up, find this delicious cannabis strain, and see if it’s your next favorite smoke. We have a feeling you’ll absolutely love it. See how others have grown this strain."
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | 40% Sativa 60% Indica",
    "tac": "30–35%",
    "length": "Medium – High",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Fruity, Creamy & Earthy",
    "supplier": "Humbolt",
    "dateCreated": "2024-08-21T08:14:36"
  },
  {
    "title": "Banana Ice Cream",
    "images": [
      "/images/strains/banana-ice-cream/banana-ice-cream-1.jpeg",
      "/images/strains/banana-ice-cream/banana-ice-cream-2.jpg",
      "/images/strains/banana-ice-cream/banana-ice-cream-3.jpg"
    ],
    "description": [
      "Banana Ice Cream strain is reminicient of a creamy banana sundae. A sweet treat that is easy to grow as the strain is lower maintenance than most strains. She doesn't need as much nutrients to grow as happily. She is an indoor and outdoor strain however outdoor is where her flavours truly flourish. Her trichomes develop into a sticky coat that covers the densley spaced nodes and nugs, that boasts her strong Banana and cookies and cream terpene profile. She is a hybrid type, and the high when smoked is balanced. A gentle onset of head high bliss that settles into the muscles. Great for a slow sunday morning before tending to your cannabis ladies in the sun or before taking a dip in the pool on a warm day. A euphoric an uplifting sensation, paired with a calming hum to the senses. The comedown doesn't leave you exhausted but serene and ready to settle into a movie with friends or to romance you into the best nap of your life. The ice cream side of her lineage: GG4 Cookies and Cream and Platinum. Genetics: Banana Sativa X Decepticon Banana Ice Cream has a high yield and her colas grow heavy as she grows so her height remains on the medium side and makes her much more managable. See how others have grown this strain"
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid",
    "length": "Medium",
    "yield": "High",
    "floweringTime": "8 Weeks",
    "terpeneProfile": "Banana, Cookies & Cream",
    "supplier": "Holy Smoke Seeds",
    "dateCreated": "2024-08-20T14:11:46"
  },
  {
    "title": "Fruit King",
    "images": [
      "/images/strains/fruit-king/fruit-king-1.jpg",
      "/images/strains/fruit-king/fruit-king-2.jpeg"
    ],
    "description": [
      "Fruit King from In House Genetics a result of crossing Forbidden Fruit x King Sherb. Forbidden Fruit is a legendary variety of unknown origin obtained by crossing the varieties Cherry Pie x Tangie. Forbidden Fruit flowers have dense dark forest green, pebble-shaped buds with sparse orange hairs and a thick frosty coating of mint green trichomes. The aroma is very sweet, with an undertone of pine that is complemented by lemon berries and earth. King Sherb is a variety created by the breeder himself by crossing OGKB v2.1 x Blue Sherbert. The combination of these two premium varieties gives us a development and power worthy of its ancestry. Its flowers are large and dense, with gaseous notes that will envelop the entire growing area. The floral and earthy scent of OG Kush Breath blends with the sweet blueberry and citrus of Blue Sherb, making it a sweet variety. See how others have grown this strain"
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | Indica",
    "tac": "30%+",
    "yield": "High",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Sweet Fruit and Citrus",
    "supplier": "In-House-Genetics",
    "dateCreated": "2024-08-19T13:05:59"
  },
  {
    "title": "Masterpiece",
    "images": ["/images/strains/masterpiece/masterpiece-1.jpg"],
    "description": [
      "Natural Highs is happy to present Masterpiece by In House Genetics, encounter between Cap Junky and Platinum, two super genetics. It is a vigorous strain with flowers worthy of the envy of any dispensary. This variety is now available in our feminized cannabis seeds catalogue. Cap Junky, the parental, is a hybrid developed from a collaboration between Seed Junky and Capulator, two of the most influential breeders on the cannabis scene. It boasts THC levels of over 30%, yet is really well-known for the aroma. A pungent waft of petrol and fermented fruit will waft through the room once you open a Cap Junky jar. Platinum, the other parental, is an in-house bred strain cross between UW Hash plant x Permafrost S1. A variety with Indica genetics, notably primarily for an excellent production of top quality trichomes. It produces fresh terpenes with wood and pine notes. Masterpiece is a to USA plant. It presents a fully hybrid structure. The size of the specimens is average, as well as the distance between nodes. Indoors it requires about 8-9 weeks to be ready to harvest, and outdoors it is ready to harvest in October. This strain delivers a powerful effect due to the incredible amounts of cannabinoids in the buds. The user will experience an initial euphoric high which, briefly, progresses into a more relaxing and calming state. See how others have grown this strain"
    ],
    "price": 125,
    "inStock": false,
    "type": "Hybrid | Indica Dominant",
    "tac": "30%+",
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Pine, Sweet and Earthy",
    "supplier": "In-House-Genetics",
    "dateCreated": "2024-08-19T11:40:45"
  },
  {
    "title": "Nana Sorbet",
    "images": [
      "/images/strains/nana-sorbet/nana-sorbet-1.jpg",
      "/images/strains/nana-sorbet/nana-sorbet-2.jpg",
      "/images/strains/nana-sorbet/nana-sorbet-3.jpg"
    ],
    "description": [
      "Nana Sorbet Lineage: SUNSET SHERBET X BANANA BUTTER CUPS",
      "The extremely rare and exclusive strain Banana Butter Cups is made of (Banana Punch „Loki Gro Cut“) x (PB & Jealous). It has a unique a extremely pungent smell and taste of sour overripe bananas paired with extreme dank. She is a absolute frost and terp machine with boutique flavours! Nanaz is a cross between Banana Butter Cups and the all-time favourite Sunset Sherbet from the Westcoast Legend Sherbinski, which yields really good and gives you a terp explosion of gassed out and creamy banana goodness that fills the room as soon as you open the jar! Nana Sorbet is also a great strain for extractions of all kind. See how others have grown this strain"
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid | 25% Sativa & 75% Indica",
    "tac": "31%",
    "yield": "High",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Sour, Overripe bananas, Gassy",
    "supplier": "Indica",
    "dateCreated": "2024-08-19T08:11:46"
  },
  {
    "title": "Nana Glue",
    "images": [
      "/images/strains/nana-glue/nana-glue-1.jpg",
      "/images/strains/nana-glue/nana-glue-2.jpg",
      "/images/strains/nana-glue/nana-glue-3.jpg",
      "/images/strains/nana-glue/nana-glue-4.jpg"
    ],
    "description": [
      "Nana Glue lineage: GG4 X BANANA BUTTER CUPS",
      "The extremely rare and exclusive strain Banana Butter Cups is made of (Banana Punch „Loki Gro Cut“) x (PB & Jealous). It has a unique and extremely pungent smell and taste of sour overripe bananas paired with extreme dank. She is an absolute frost and terp machine with boutique flavours! Crossed to the multiple award-winning champion Gorilla Glue #4 you will get a super pungent and heavy yielding variety called Nana Glue. The terps on her are eyewatering! The piney and earthy tones from the GG#4 melt into the sour overripe bananas of the Banana Butter Cups. This strain is just another highlight from Square One Genetics and another great candidate for extracts! See how others have grown this strain"
    ],
    "price": 150,
    "inStock": false,
    "type": "Hybrid | 25% Sativa & 75% Indica",
    "tac": "31%",
    "yield": "Medium – High",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Gas, Sour, Wood",
    "supplier": "Indica",
    "dateCreated": "2024-08-19T07:31:15"
  },
  {
    "title": "Colorado Nightshifter",
    "images": [
      "/images/strains/colorado-nightshifter/colorado-nightshifter-1.jpg",
      "/images/strains/colorado-nightshifter/colorado-nightshifter-2.jpg",
      "/images/strains/colorado-nightshifter/colorado-nightshifter-3.jpg",
      "/images/strains/colorado-nightshifter/colorado-nightshifter-4.jpg"
    ],
    "description": [
      "TROP CHERRY X FROZAY 94",
      "Colorado Night shifter was created when hitting our famous Trop Cherry cut with our closely held Frozay94 cut. The seeds produced a variety of phenos ranging from Trop Cherry with citrus and cherry terps to Frozays berry fruit rollup terps. Many phenos will be red or purple from the start of flower. Some will look more like a bigger gelato with darker colors. High calyx to leaf ratio. Most are done flowering in 9wks or less. Very fun grow with many keepers to be found. Exceptional bag appeal and flavor that blows smokers minds. Breeders from Relentless Genetics took the Trop Cherry, also known as Trop Cherry #8 breeder's cut, and reversed it to its unreleased Frozay #94 pheno. The outcome is an incredibly vibrant and dense strain, marking it as one of Relentless Genetics' finest creations. Over several years of meticulous breeding for color and terpene profiles, this crossbreed exhibits a wide range of hues, including shades of purple, pink, and red flowers. The Frozay #94 imparts a remarkable density and weight to the buds. All phenotypes of Colorado Night shifter complete their flowering cycle in 9 weeks or less and possess an incredible potency, especially for a purple strain. Colorado Night shifter is known as the second version, the first version involved reversing Frozay #94 to Trop Cherry, whereas the 2nd follows the opposite approach. Both strains can be regarded as exotic, as enthusiasts often describe them. Although they were quite similar, version 2 exhibits a slightly stronger influence from Frozay #94. Unfortunately, both of them had limited seed production."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | Sativa 60% & Indica 40%",
    "tac": "21%",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Sweet Cream and Cherry Citrus",
    "supplier": "Relentless Genetics",
    "dateCreated": "2024-08-15T14:32:13"
  },
  {
    "title": "Wedding Cheesecake",
    "images": [
      "/images/strains/wedding-cheesecake/wedding-cheesecake-1.webp",
      "/images/strains/wedding-cheesecake/wedding-cheesecake-2.webp",
      "/images/strains/wedding-cheesecake/wedding-cheesecake-3.webp"
    ],
    "description": [
      "A delight for the mind and body: Wedding Cheesecake FF (Fastflowering) is a delicious strain that offers XXL yields in a 7-8 weeks flowering cycle. This terpene powerhouse produces loads and loads of mouth-watering vanilla-creamy-cookie-scented terps with hints of citrus and cinnamon. In addition to its delicious aromas, this variety grows very well in both indoor and outdoor setups, yielding up to 650 g/m2 without extra maintenance, making it the ideal strain for beginners as it allows you to maximize yields while minimizing work. This superfast feminized photoperiod version offers upbeat and energetic yet deeply relaxing effects that are perfect for consumers looking for a heavily focused, motivating, and creative high. With up to 25% THC, It’s the ideal strain for those needing that extra energy boost to start a busy day on the right foot. Bud Description  Wedding Cheesecake FF boasts chunky, large-sized buds with a thick layer of silvery-white resin and bright orange hairs scattered all over: that just screams ‘quality’. The lime-green flowers sparkle with an array of hues ranging from dark to light green, to magenta and purple, and reek of a delicious aroma that’ll remind you of fresh store-bought cheesecake. As you break the buds open, expect a deliciously cheesy and creamy aroma with a citrus zest to it and a sweet nuttiness that rounds it up and smoothes out the smoke. Smoke Reports  Expect an effect that’s just as delicious as the aroma. This strain’s effects are more cerebral than physical and start as a powerful cerebral rush that lifts your mood, leaving you in a nice state of happiness that eliminates all negativity and stress. As you continue to smoke, the strong body high starts to creep up and puts you into a calm, deeply relaxing state that takes the edge off and puts you in a peaceful state of mind. Wedding Cheesecake FF offers a powerful yet finely balanced mix of Indica and Sativa effects, allowing you to experience the best of both worlds. Plant Appearance  This is an XXL hybrid that grows extremely tall in height, reaching up to 3m with one huge main cola and multiple long side branches that can withstand enormous yields of up to 650 g/m2 with ease. Wedding Cheesecake FF is extremely resilient to the elements and can be grown in almost every climate as long as you’ve got the space and basics covered, making her an excellent choice for those looking for large-scale harvests with a quick turnaround time without much effort. Grow Tips  This is a super fast feminized photoperiod version that takes approximately 7-8 weeks to flower with a 5-week vegetation cycle, this means you can have faster harvests by shortening the veg cycle or have a longer veg cycle for bigger yields. To enhance the delicious creamy/cheesy flavours even more, make sure to flush thoroughly during the last weeks of harvest. It’s highly recommended to tie down or scrog Wedding Cheesecake FF (Fastflowering) as it develops long side branches that respond really well to LST techniques and will reward you with even denser buds. Flavour Wedding Cheesecake FF offers a distinctive mix of sweet, earthy, and fruity terps that taste just like baked tart and creamy cheesecake. As you inhale, expect a creamy nutty vanilla taste with hints of cinnamon that fill your whole mouth with creamy deliciousness. As you exhale, the creamy, nutty flavours open up, giving place to a powerful blend of citrus zests with touches of floral and herb terps that are out of this world. Truly bold and complex flavours that taste just as it smells and will keep you guessing after every pull of a joint."
    ],
    "price": 125,
    "inStock": true,
    "type": "Hybrid | 65% Sativa 35% Indica",
    "tac": "25%",
    "length": "Medium – Tall",
    "yield": "Extra Large",
    "floweringTime": "7 – 8 Weeks",
    "terpeneProfile": "Sweet, Dough, Fruity, Cream",
    "supplier": "Fast Buds",
    "dateCreated": "2023-12-14T14:42:19"
  },
  {
    "title": "Slubert",
    "images": [
      "/images/strains/slubert/slubert-1.webp",
      "/images/strains/slubert/slubert-2.webp"
    ],
    "description": [
      "Slurbert or “Slurrbert”  is a well-balanced hybrid strain (50% Indica/50% Sativa) created by crossing Slurricane with Sunset Sherbert, both very famous strains. In America, its taste and aroma are popular among hybrid cannabis lovers. It has a strong citrus flavour mixed with fruity notes followed by refreshing herbal and earthy scents. The ultimate strain that shouldn't be missed: “Slurbert Marijuana Strain”, the source of inspiration for the ultimate mood creator!"
    ],
    "price": 125,
    "inStock": true,
    "type": "Balanced Hybrid |50% Sativa 50% Indica",
    "tac": "26%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "8 Weeks",
    "terpeneProfile": "Orange, Lemon, Sweet",
    "effects": "Insomnia, Stress and Depression",
    "supplier": "In-House-Genetics",
    "dateCreated": "2023-12-14T12:59:44"
  },
  {
    "title": "Slurricane #7",
    "images": [
      "/images/strains/slurricane-7/slurricane-7-1.jpeg",
      "/images/strains/slurricane-7/slurricane-7-2.jpeg",
      "/images/strains/slurricane-7/slurricane-7-3.jpg",
      "/images/strains/slurricane-7/slurricane-7-4.webp",
      "/images/strains/slurricane-7/slurricane-7-5.jpg"
    ],
    "description": [
      "Slurricane is an indica cannabis strain made by crossing Do-Si-Dos with Purple Punch. Slurricane produces relaxing effects that come on slowly. This strain has a sweet flavour profile, with subtle grapes and sugary berries. Slurricane is the ideal strain for relaxing after a long day and will likely leave you locked to your sofa. Medical cannabis patients choose this strain to help relieve symptoms associated with insomnia. Smoking Slurricane can be especially useful when you’re down with a common cold or flu."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 40% Sativa 60% Indica",
    "tac": "21–25%",
    "length": "Medium – Tall",
    "yield": "Medium",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Fruity, Berries and Herbal",
    "effects": "Anxiety, Stress and Insomnia",
    "supplier": "In-House-Genetics",
    "dateCreated": "2023-11-09T10:12:28"
  },
  {
    "title": "Tart Pops",
    "images": [
      "/images/strains/tart-pops/tart-pops-1.jpg",
      "/images/strains/tart-pops/tart-pops-2.jpeg",
      "/images/strains/tart-pops/tart-pops-3.jpg",
      "/images/strains/tart-pops/tart-pops-4.jpg"
    ],
    "description": [
      "Tart Pops is a mostly Indica variety from In-House genetics and can be cultivated indoors (where the plants will need a flowering time of ±60 days) and outdoors. Lineage: (SKUNK x TANGIE x ZKITTLES) x PURPLE PUNCH"
    ],
    "price": 125,
    "inStock": false,
    "type": "Fem Photo, Indica Dominant Hybrid",
    "tac": "25–30%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Apple, Fruity",
    "effects": "Anxiety, Pain and Cramps",
    "supplier": "In-House-Genetics",
    "dateCreated": "2023-11-09T09:44:37"
  },
  {
    "title": "Crescendo Rbx1",
    "images": [
      "/images/strains/crescendo/crescendo-1.jpg",
      "/images/strains/crescendo/crescendo-2.jpg",
      "/images/strains/crescendo/crescendo-3.jpg"
    ],
    "description": [
      "Crescendo RXB1 clones produce medium-sized plants that develop with a marked stretching as they move to the flowering stage. It is a plant with vigorous growth, balanced between the Indica and Sativa worlds. It adapts well to cultivation techniques such as SCROG, through continuous canopy pruning to develop a good lateral branching. It can be also used the SOG technique to obtain a plant with only a large central bud. Cultivated indoors, this variety will at least double in size after the change to the flowering photoperiod. This pronounced stretching develops long branches that produce a long column of tight, compact buds that are very bright due to the large resin amount. It is certainly an ideal variety for resin extraction fans. Crescendo RBX1 has a flowering period of 8-9 weeks with an abundant yield of more than 500g per m2. Cultivated outdoors, Crescendo RXB1 can grow to a large size and offer a high production as long as it is provided as many sunlight hours as possible, a good substrate amount and balanced nutrition. It is ready for harvest in October with a yield that can easily exceed 1000g per plant. Lineage: (CHEM D x I95 x MANDARIN COOKIES) x HEADBAND x I95"
    ],
    "price": 125,
    "inStock": true,
    "type": "Indica Dominant Hybrid | 40% Sativa 60% Indica",
    "tac": "30%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Citrus, Sour and Gassy",
    "effects": "Anxiety, Stress and Depression",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-11-09T09:28:49"
  },
  {
    "title": "Cinderella 99",
    "images": [
      "/images/strains/cinderella-99/cinderella-99-1.jpg",
      "/images/strains/cinderella-99/cinderella-99-2.jpeg",
      "/images/strains/cinderella-99/cinderella-99-3.jpg"
    ],
    "description": [
      "Cinderella 99, also known as \"C99,\" \"Cindy,\" and \"Cindy 99,\" is a Sativa-dominant hybrid cannabis strain bred by Mr. Soul of Brothers Grimm. This strain is best known for her potent cerebral high, sweet fruity flavours, and epic yields. According to Mr Soul, C99 was created using seeds found in a Sensi-branded 2-gram package of Jack Herer purchased at an Amsterdam coffee shop. Cinderella 99 is very popular with indoor growers because of its short, bushy stature, high yields, short flowering time, and high TAC content. Cindy’s effects are usually described as dreamy, euphoric, and uplifting. Medical marijuana patients use the effects of this strain to relieve symptoms associated with fatigue and stress. She is a mostly Sativa plant which easily triples its size during the stretch period. It needs 55-65 days to fully ripe, and loves light and nutrients, especially some extra calcium according to Brothers Grimm. Suitable for both the SOG and SCROG techniques, yields are average, although compensated by their excellent quality. The fleshy and frosty buds have a tropical fruit scent, simply delicious, while the effect is clear and cerebral, motivating and creative."
    ],
    "price": 125,
    "inStock": false,
    "type": "Sativa Dominant Hybrid | 80% Sativa 20% Indica",
    "tac": "19–23%",
    "length": "Medium",
    "yield": "Medium",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Citrus, Tropical and Grapefruit",
    "effects": "Anxiety, Stress and Depression",
    "supplier": "Brothers Grim",
    "dateCreated": "2023-11-09T09:14:37"
  },
  {
    "title": "Big Buddha Cheese",
    "images": [
      "/images/strains/big-buddha-cheese/big-buddha-cheese-1.jpg",
      "/images/strains/big-buddha-cheese/big-buddha-cheese-2.jpg"
    ],
    "description": [
      "Big Buddha Cheese, also known as “BBC,” is an offspring of the original cheese strain out of Great Britain. Bred by a grower named Big Buddha, this strain took home a major prize during the 2006 High Times Cannabis Cup. Its TAC level is high, but its exact proportion is unknown. Big Buddha Cheese is a sativa-indica hybrid, but again, the specific numbers are unclear. This strain is more popular on the West Coast, in Colorado, and in Michigan, but it's typically hard to find outside the United Kingdom and Amsterdam. With a strong cheese flavor and a pungent earthy smell, Big Buddha Cheese is a longtime classic among Brits. It's also prized for its strength in the United States and provides relief from severe pain, as well as anxiety, ADHD, migraines, GI distress, and spinal cord injuries. A dry mouth is a distinct possibility, while dry eyes and dizziness occur less frequently. The high is intensely euphoric, making this a good strain for low moods and low energy. Deep relaxation is also common, and some people find Big Buddha Cheese to be a good treatment for insomnia."
    ],
    "price": 125,
    "inStock": false,
    "type": "Balanced Hybrid | 50% Sativa 50% Indica",
    "tac": "18–23%",
    "length": "Medium – Tall",
    "yield": "Large",
    "floweringTime": "8 – 10 Weeks",
    "terpeneProfile": "Cheese, Sweet Honey and Citrus",
    "effects": "Pain, Anxiety, ADHD and Migraines",
    "supplier": "Big Buddha Genetics",
    "dateCreated": "2023-11-09T09:01:14"
  },
  {
    "title": "Runtz Muffin",
    "images": [
      "/images/strains/runtz-muffin/runtz-muffin-1.jpeg",
      "/images/strains/runtz-muffin/runtz-muffin-2.jpg",
      "/images/strains/runtz-muffin/runtz-muffin-3.jpg"
    ],
    "description": [
      "Runtz Muffin is a 70/30 Indica Sativa hybrid. It is the result of the encounter between Runtz (Zkittlez and Gelato), and Orange Punch which enhances Runtz's production and offers an even more desirable aroma. It produces compact growing plants, reaching up to 1-1.20m indoors in about 4 weeks of development. Cultivated outdoors in open ground can reach up to 2m. Runtz Muffin has a fast-flowering period, between 56-63 days of maturation, with a yield of up to 550-600g per m2. In outdoor cultivation, the marijuana harvest is ready in October. This strain has easy and fast cultivation. It will delight the grower with a top-quality harvest very rich in trichomes, terpenes and cannabinoids. It offers a fruity terpenes profile dominated by lavender and orange. It is a first-quality fruity, sweet and floral aroma. Runtz Muffin produces an intense effect thanks to its richness in active ingredients, with a TAC level of up to 29%. The effect is relaxing and positive, ideal to combat stress and bad mood, immersing you in a well-being and relaxation sweet feeling."
    ],
    "price": 125,
    "inStock": true,
    "type": "Indica Dominant Hybrid | 30% Sativa 70% Indica",
    "tac": "29%",
    "length": "Medium – Tall",
    "yield": "Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Creamy, Fruit, Candy, Pineapple and Citrus",
    "effects": "Stress and Bad Moods",
    "supplier": "Barney's Farm",
    "dateCreated": "2023-11-09T08:44:42"
  },
  {
    "title": "Blue Cheese",
    "images": [
      "/images/strains/blue-cheese/blue-cheese-1.jpg",
      "/images/strains/blue-cheese/blue-cheese-2.jpg"
    ],
    "description": [
      "Blue Cheese lineage: Big Buddha Cheese x Blueberry Cheese. It is one of the best and strongest on the market and is guaranteed to knock your head off. This is an easy-to-grow strain, which creates an incredible yield of fragrant and tasty buds. The intense aged-cheese flavours are softened by a sweet blueberry aftertaste. The short stocky plant has strong side branches which develop heavy sticky colas in a short flowering period. Prepare to relax because this is a true sensation for Indica enthusiasts. This is now available in an auto-flowering strain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Indica Dominant Hybrid | 20% Sativa 80% Indica",
    "tac": "23%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Sweet, Cheese, Berry and Spicy",
    "effects": "Insomnia",
    "supplier": "Barney's Farm",
    "dateCreated": "2023-11-09T08:36:02"
  },
  {
    "title": "Strawberry Cookies Og R1",
    "images": [
      "/images/strains/strawberry-cookies-og/strawberry-cookies-og-1.jpg",
      "/images/strains/strawberry-cookies-og/strawberry-cookies-og-2.jpg"
    ],
    "description": [
      "Strawberry Cookies OG R1 feminized seeds by Ethos Genetics are the result of crossing Strawberry OG IBL x Ethos Cookies #16 strains. Strawberry OG (not to be confused with OG Strawberry) is the product of a painstaking search for a stable strawberry flavour mixed with Bruce Banner's exceptional structure, yield and early flowering schedule. On the other hand, we have the Ethos Cookies that offer us that aroma of sweet cookies so rich and valued by consumers. We can expect a plant that grows like a champion and Its flowers develop with medium-length internodes. The high calyx/leaf ratio allows this tall plant to sprout profusely from all its branches. It works best if topped after the first big set of branches comes out. A variety with which lovers of extractions will find a jewel."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 70% Indica 30% Sativa",
    "tac": "25–30%",
    "length": "Medium – Tall",
    "yield": "Large",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Sweetest Strawberry, Gas and Pine",
    "effects": "Chronic Pain",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-11-09T07:55:29"
  },
  {
    "title": "Mandarin Zkittlez R1",
    "images": [
      "/images/strains/mandarin-zkittlez/mandarin-zkittlez-1.jpg",
      "/images/strains/mandarin-zkittlez/mandarin-zkittlez-2.jpg"
    ],
    "description": [
      "Ethos Genetics Mandarin Zkittlez is a feminized cannabis plant, a Sativa Indica hybrid between Mandarin Sunset and California Black Rose, two cannabis contest winners with a great reputation and recognition. Two varieties are characterized by an incredible terpene profile. Genetic line The mother is the California Black Rose original clone from Dying Breed Seeds, a variety of great potency, production and incredible flavour. The father, Mandarin Sunset, is one of the Ethos Genetics varieties with a more powerful terpene profile. The result is a hybrid that will delight lovers of powerful and fruity flavours. Easy-to-cultivate plant Mandarin Zkittlez development is very easy to manage both indoors and outdoors. It adapts very easily to all cultivation methods, recommending organic fertilization in soil substrate in order to obtain the best terpene quality. The plant develops branches in the lower and middle part, which is optimal for SCROG cultivation. The main tip protrudes over the secondary branches, thus SOG technique can be also used. high-quality flowering produces medium-sized compact buds totally covered with trichomes. It has a short flowering period; with just 8 to 9 weeks, we can obtain a maximum flower quality. The dark purple, black and red leaves together with the glossy resin and its orange stigmas enhance the buds providing a very appetizing appearance at sight. Aromas and flavours The aromas and flavours are very much noticeable both during cultivation and once harvested. Its organoleptic profile is a pungent and balanced mixture of fruits such as grapes, grapefruit, tangerine and orange with spicy hash notes that are transferred entirety to our taste buds. It delivers a cheerful, euphoric, relaxing and powerful psychedelic long-lasting effect."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 60% Indica 40% Sativa",
    "tac": "25%",
    "length": "Medium – Tall",
    "yield": "Above Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Grape, Spicy Orange and Grapefruit",
    "effects": "Anxiety, Cramps, Lack of Appetite",
    "supplier": "Indica",
    "dateCreated": "2023-11-06T14:52:59"
  },
  {
    "title": "Apex R1",
    "images": [
      "/images/strains/apex/apex-1.jpg",
      "/images/strains/apex/apex-2.jpg"
    ],
    "description": [
      "Ethos Apex R1 is the variety that we have included in our catalog at your request, from the Ethos Genetics bank. The cross comes from two successful bank varieties such as Lilac Diesel and Mandarin Cookies. On the one hand, Lilac Diesel is a strong and aggressive plant with medium-length internodes and heavy lateral branching. It has large, fluffy but solid flowers, making this cross a great producer with a high development. The other part of the cross is the well-known Mandarin Cookies, which have strong growth and may need some light training. It can stretch quite a bit in bloom but is controllable. The floral structure of this plant is one of the best you will find. Medium-sized, dense and stacked with perfectly spaced internodes and a low leaf-to-calyx ratio. The crossing of both makes Ethos Apex R1 a variety that grows with great violence but is easy to train. Medium-long internodes pack large flowers of medium density that give large yields of boutique flowers. The effects are classic stoner, lots of laughs with a clear but powerful punch."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 80% Sativa 20% Indica",
    "tac": "30%",
    "length": "Medium – Tall",
    "yield": "Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Lemon sweets to Grapefruit, Fuel and Orange",
    "effects": "Anxiety, Nausea, Pain",
    "supplier": "Indica",
    "dateCreated": "2023-11-06T13:59:10"
  },
  {
    "title": "Peanut Butter Breath",
    "images": [
      "/images/strains/peanut-butter-breath/peanut-butter-breath-1.jpeg",
      "/images/strains/peanut-butter-breath/peanut-butter-breath-2.jpg",
      "/images/strains/peanut-butter-breath/peanut-butter-breath-3.webp",
      "/images/strains/peanut-butter-breath/peanut-butter-breath-4.jpg"
    ],
    "description": [
      "Peanut Butter Breath, also known as \"Peanut Butter\" and \"Peanut Breath,\" is a hybrid cannabis strain known for its sedating effects. Crossed with Do-Si-Dos and Mendo Breath, Peanut Butter Breath has a unique nutty and earthy terpene profile when smoked. Beyond the terps, this strain will bring you down into a quality state of chill and relaxation. Originally from Thug Pug Genetics, Peanut Butter Breath is very popular and there are many Do-Si-Dos and Mendo Breath crosses out there—breeders Clout King have one called “Peanut Butter Cup.”"
    ],
    "price": 125,
    "inStock": false,
    "type": "Balanced Hybrid | 50% Indica 50% Sativa",
    "tac": "28%",
    "length": "Medium – Tall",
    "yield": "Medium",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Nutty, Butter, Chestnut",
    "effects": "Anxiety, Stress, Depression",
    "supplier": "Suggested Strains",
    "dateCreated": "2023-11-06T13:48:41"
  },
  {
    "title": "Grape Diamonds R2",
    "images": [
      "/images/strains/grape-diamonds/grape-diamonds-1.jpg",
      "/images/strains/grape-diamonds/grape-diamonds-2.jpg",
      "/images/strains/grape-diamonds/grape-diamonds-3.jpg"
    ],
    "description": [
      "Ethos Genetics Grape Diamonds R2 is a cannabis plant cross between two phenotypes coming from the same variety, Member Berry, a hybrid between Skunk Berry x Mandarin Sunset and cup winner both in flower and in extraction. Thus, the result is Grape Diamonds R2, a more complete plant at all levels. Grape Diamonds have a vigorous development, a well-branched plant with short-medium internodal distances. Its dark green leaves can acquire purple colours up to the temperature, creating a true visual spectacle. It is easy to cultivate and manage, using hydroponic cultivation systems with automatic irrigation such as Floraflex or in conventional cultivation such as soil. It is suitable for both SOG performing low pruning and SCROG using topping as a pruning technique. Grape Diamonds R2 flowering stage is exuberant, producing large, voluminous, and heavy buds that mature rapidly after about 9 weeks. It offers abundant harvest both indoors with a yield exceeding 600g per m2 and outdoors where you can expect a yield above 1000g per plant, harvested in October. Its flowers are completely covered with trichomes, offering a gleaming appearance contrasting with the purple colour of the leaves. It delivers a powerful effect with a Sativa character thanks to the cannabinoid level of up to 30%. It contains a CBD level of 1%, CBG level of 1% and high THC levels of up to 25% or even more. Lineage: GRAPE DIAMONDS x PINK GRAPEFRUIT"
    ],
    "price": 125,
    "inStock": true,
    "type": "Balanced Hybrid | 50% Sativa 50% Indica",
    "tac": "25–30%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Grape, Tart Grapefruit and Propane",
    "effects": "Anxiety, Stress and Migraines",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-08-03T16:33:46"
  },
  {
    "title": "Freakshow",
    "images": [
      "/images/strains/freakshow/freakshow-1.jpeg",
      "/images/strains/freakshow/freakshow-2.jpg",
      "/images/strains/freakshow/freakshow-3.jpg"
    ],
    "description": [
      "Freakshow by Humbolt are feminized clones.",
      "Freakshow was specially bred by Humboldt breeder Shapeshifter. While it debuted in 2019, Humboldt Seed Co. recently relaunched this revised version of Freakshow with a completely new (and even crazier) array of grow traits. She boasts fern-like leaves, beautiful, resin-rich orange buds, and sativa-dominant genetics. Thanks to the meticulous breeding work of Shapeshifter and the rest of the team at Humboldt Seeds, this unique cannabis mutation is now available to growers everywhere. As you grow Freakshow (affectionately referred to as Cannabis Lusus Monstra), you'd be forgiven for thinking you've been cheated and sold seeds of some kind of weird ornamental tree. Besides her stem, there's really nothing about this strain that says cannabis (at least not while it vegetates); her leaves look like those of a fern or Chinese jasmine, and her structure (which is very top-heavy, with little to no foliage along the lower parts of the plant) almost looks like that of a bonsai tree. Grow her alongside other cannabis strains and you'll likely notice Freakshow's underlying sativa dominance in her slim branches and tendency to stretch. It's only once she starts flowering that you'll be reminded you're actually growing weed. Her bloom cycle lasts roughly 65 days, and Humboldt Seed Co. claims she produces modest harvests. Beneath her mutated leaves, Freakshow will reveal beautiful, bright green buds adorned with stunning orange pistils and a thick coating of resin. Her aroma is very tropical, with notes of mango and ripe peaches, and slight sour undertones. Light her up, and Freakshow will hit you with up to 18% THC and a rich mix of terpenes that activate the mind while relaxing the body. Expect to feel tingly, talkative, and social before enjoying a mellow, lingering stone."
    ],
    "price": 125,
    "inStock": true,
    "type": "Sativa | 90% Sativa 10% Indica",
    "tac": "18–20%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Pine, Spicy and Sour",
    "supplier": "Humbolt",
    "dateCreated": "2023-08-03T16:22:43"
  },
  {
    "title": "Rotten Apple",
    "images": [
      "/images/strains/rotten-apple/rotten-apple-1.jpeg",
      "/images/strains/rotten-apple/rotten-apple-2.jpg"
    ],
    "description": [
      "To create Rotten Apple, Perfect Tree crossed their selection of the Lemon Butter Cream (Triangle Kush x Sour Apple IBL) from Alien Genetics with Perfect Tree's Jet A reversal. The biggest advantage of this strain is its high yield and chunky buds, beautifully covered in trichomes. The taste and aroma are one of the key features thanks to her outstanding lineage. Look forward to fuel and gassy notes from Triangle Kush & Jet A with a sweet and fresh hint of Sour Apple. Some phenotypes maybe even sweeter, thanks to the delightful notes of baked caramel that bring to mind the flavour of apple cider syrup. Rotten Apple is rather easy to grow and needs 8 weeks to bloom."
    ],
    "price": 125,
    "inStock": true,
    "type": "Balanced Hybrid | 50% Sativa 50% Indica",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "8 Weeks",
    "terpeneProfile": "Ripe Apples, Fuel and Gas",
    "supplier": "Perfect Tree Genetics",
    "dateCreated": "2023-06-24T08:06:49"
  },
  {
    "title": "Cherry Whip",
    "images": [
      "/images/strains/cherry-whip/cherry-whip-1.jpg",
      "/images/strains/cherry-whip/cherry-whip-2.jpg",
      "/images/strains/cherry-whip/cherry-whip-3.jpg"
    ],
    "description": [
      "Cherry Whip is the result of breeding Black Cherry Pie and King Sherb.",
      "Black Cherry Pie It is a variety created by the breeder himself by crossing the varieties, Black Cherry Soda x 501st OG. This variety has been used by the breeder in several of his creations due to its characteristic aroma and power. Varieties like Alien Moon Pie, Cherry Gorilla or Velvet Pie used Black Cherry Pie in its crossing providing the skunk cherry aroma of this variety. Black Cherry Pie It is a very easy variety to grow and responds very well to topping. The size of this plant is low-medium, but it gives us a heavy yield with a spectacular aroma. King Sherb is a variety created by the breeder himself by crossing OGKB v2.1 x Blue Sherbert. The combination of these two premium varieties gives us a development and power worthy of its ancestry. Its flowers are large and dense, with gaseous notes that will envelop the entire growing area. The floral and earthy scent of OG Kush Breath blends with the sweet blueberry and citrus of Blue Sherb, making it a sweet variety."
    ],
    "price": 125,
    "inStock": true,
    "type": "Indica Dominant Hybrid | 30% Sativa 70% Indica",
    "tac": "21–25%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "9 – 10 Weeks",
    "terpeneProfile": "Sorbet, Cherry and Diesel",
    "supplier": "In-House-Genetics",
    "dateCreated": "2023-06-24T07:03:05"
  },
  {
    "title": "Platinum Float",
    "images": [
      "/images/strains/platinum-float/platinum-float-1.jpg",
      "/images/strains/platinum-float/platinum-float-2.jpg"
    ],
    "description": [
      "Platinum Float de Inhouse Genetics are feminized clones as a result of crossing (GMO Rootbeer BX1) x (Platinum Kush) With both combined effects of the GMO Rootbeer BX1 and the Platinum Kush, In-House Genetics has given us an Indica dominant Hybrid."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 25% Sativa 75% Indica",
    "floweringTime": "9 – 10 Weeks",
    "supplier": "In-House-Genetics",
    "dateCreated": "2023-06-24T06:38:46"
  },
  {
    "title": "White Wedding Rbx",
    "images": [
      "/images/strains/white-wedding/white-wedding-1.jpg",
      "/images/strains/white-wedding/white-wedding-2.jpg",
      "/images/strains/white-wedding/white-wedding-3.jpg",
      "/images/strains/white-wedding/white-wedding-4.jpg",
      "/images/strains/white-wedding/white-wedding-5.jpg",
      "/images/strains/white-wedding/white-wedding-6.jpg",
      "/images/strains/white-wedding/white-wedding-7.jpg"
    ],
    "description": [
      "The flowers of White Wedding RBX mature after about 9 weeks, developing rocky flower colas of great volume all over the branches and offering a spectacular calyx-leaf ratio. Delivers a yield of up to 600g per m2 when cultivated in an indoor grow tent under a 600W light, while outdoors provided with a sufficient growth period it becomes a resinous monster producing a yield that can even exceed 800g per plant. The buds are completely covered with resin trichomes, even flooding the nearby leaves, making it a great strain for extractions. They present a very high terpene load that provides an intense aroma that combines petrol with sour pine, incense, tangerines, and ripe cherries. White Wedding RBX produces a strong effect both physically and mentally (THC: 25-30%, CBG: 2%, CBC: 1%, THCV: 0.3%). This effect begins with a powerful psychedelic euphoric high that enhances the senses and creativity as it hits the body, relaxing muscles, and relieving pain."
    ],
    "price": 125,
    "inStock": true,
    "type": "Indica Dominant Hybrid | 20% Sativa 80% Indica",
    "tac": "30+%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "9 Weeks",
    "terpeneProfile": "Sour Gasoline, Pine and Mandarin",
    "effects": "Muscle Tension, Anxiety and Depression",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-06-19T14:46:59"
  },
  {
    "title": "Samo 78",
    "images": [
      "/images/strains/samo-78/samo-78-1.jpg",
      "/images/strains/samo-78/samo-78-2.jpeg",
      "/images/strains/samo-78/samo-78-3.jpg",
      "/images/strains/samo-78/samo-78-4.jpg"
    ],
    "description": [
      "Samo 78 is the result of Pancake Ice and Ethos Haze IBl strain and embodies the best of both. Pancake Ice is a 70/30 sativa dominant hybrid strain created through a combination of Chemdog x Mandarin Cookies. It seems that for this cross, the bank opted for the Original Crescendo phenotype, giving it a rather rare find and highly sought after for its unique aroma. Her buds smell sweet and fruity with hints of sugary syrup and a touch of pepper, with an earthy herbal undertone that is accentuated by spicy diesel and syrupy sweet fruits. As a result of the crossbreeding, this plant has large, fat, hand-shaped buds that are bright neon green in colour with fine orange hairs and a layer of tiny golden amber crystal trichomes. Ethos Haze IBL surprised us a few months ago with its enormous production and performance both indoors and outdoors. This sativa-dominant hybrid strain comes from selected blends of true old-school titans within the industry, such as Super Lemon Haze and Jack Herer. It seems that the growers of this variety define it as a plant extremely vigorous and tall, with fairly long internodes, very large flowers and long, thin leaf blades. See how others have grown this strain"
    ],
    "price": 125,
    "inStock": true,
    "type": "Sativa Dominant Hybrid | 70% Sativa 30% Indica",
    "tac": "30%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "10 Weeks",
    "terpeneProfile": "Lemon, Gasoline and Spices",
    "effects": "Pain, Stress and Anxiety",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-06-19T14:34:13"
  },
  {
    "title": "Grandpa's Cookies #6 S1",
    "images": [
      "/images/strains/grandpas-cookies-6/grandpas-cookies-6-1.jpeg",
      "/images/strains/grandpas-cookies-6/grandpas-cookies-6-2.jpg"
    ],
    "description": [
      "Grandpa's Cookies #6 is a selected cut of its cross between Grandpa's Stash and Ethos Cookies. This variety has a strong and vigorous development, with a fairly fast flowering. The super-dense buds are the size of a golf ball, fully covered in sticky resin and have an unbeatable aroma. As a result of this cross, its development outdoors is spectacular, giving true monsters with greater lateral development than in height. It responds perfectly to different types of pruning depending on the grower's needs, both indoors and outdoors. The dense and penetrating aroma is marked with spicy touches that make this variety very characteristic. See how others have grown this strain."
    ],
    "price": 125,
    "inStock": false,
    "type": "Indica Dominant Hybrid | 20% Sativa 80% Indica",
    "tac": "25–30%",
    "length": "Medium",
    "yield": "Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Orange, Lemon and Grapefruit",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-06-19T14:22:14"
  },
  {
    "title": "Fanta Sea Rbx",
    "images": [
      "/images/strains/fanta-sea/fanta-sea-1.jpeg",
      "/images/strains/fanta-sea/fanta-sea-2.jpeg",
      "/images/strains/fanta-sea/fanta-sea-3.jpg",
      "/images/strains/fanta-sea/fanta-sea-4.jpg",
      "/images/strains/fanta-sea/fanta-sea-5.jpg"
    ],
    "description": [
      "Fanta Sea RBX is a medium-sized cannabis variety that easily adapts to almost any environment and growing medium. It is a robust plant that produces strong branches with a short node distance. Thanks to its excellent bract/leaf ratio, it is very easy to manicure. Once the vegetative period is complete, it takes about 63 days at 12/12 to mature. It is ready to harvest outdoors in early October, offering a high production. The flowers, once dried, are of high quality with a THC level of up to 30%. Fanta Sea RBX produces dense buds with a thick resin layer that enhances a great colour range. Ethos Genetics seed bank refers to it as a boutique cannabis variety. Her flavours remind us of sweet pastry dough, with powerful orange, sandalwood, and petrol aromas. This strain produces a long-lasting powerful effect which remains over time, causing euphoria with a very motivating relaxation afterwards. Lineage: (WEDDING CAKE X TRIANGLE KUSH) x (MANDARIN COOKIES) x GRANDPA'S COOKIES #6 See how others have grown this strain."
    ],
    "price": 125,
    "inStock": false,
    "tac": "25–30%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Cake Batter, Oranges and Sandalwood",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-06-19T13:54:37"
  },
  {
    "title": "Mandarin Cookies R3",
    "images": [
      "/images/strains/mandarin-cookies/mandarin-cookies-1.jpg",
      "/images/strains/mandarin-cookies/mandarin-cookies-2.jpeg",
      "/images/strains/mandarin-cookies/mandarin-cookies-3.jpg"
    ],
    "description": [
      "Many years of breeding have gone into making this more homogenous version of Mandarin Cookies. We've finally captured all of the various desired qualities from previous versions and have them all in this one. Expect INTENSE terpenes, along with large, extremely dense flowers completely coated with trichomes. She’s amazing for extractions and easy to grow in any environment. Her effects are long-lasting, enjoyable and chill—but not sleepy. Medium height with good vigour and perfect internode spacing. She grows well in any system or environment. Extremely dense with a high bract-to-leaf ratio. She’s covered in trichomes and super terpy. Lineage: MANDARIN COOKIES #7 x MANDARIN COOKIES #17"
    ],
    "price": 125,
    "inStock": false,
    "type": "Sativa Dominant Hybrid | 70% Sativa 30% Indica",
    "tac": "25–30%",
    "length": "Medium",
    "yield": "Extra Large",
    "floweringTime": "8 – 9 Weeks",
    "terpeneProfile": "Tangerine, Skunk and Spices",
    "effects": "Stress and Pain",
    "supplier": "Ethos Genetics",
    "dateCreated": "2023-06-12T11:02:48"
  }
]
